konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/powman.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : POWMAN
# Version        : 1
# Bus type       : apb
# Description    : Controls vreg, bor, lposc, chip resets & xosc startup,
#                  powman and provides scratch register for general use and for
#                  bootcode use
# =============================================================================
.ifndef	_HARDWARE_REGS_POWMAN_H
.set	_HARDWARE_REGS_POWMAN_H, 1
# =============================================================================
# Register    : POWMAN_BADPASSWD
# Description : Indicates a bad password has been used
.equ	POWMAN_BADPASSWD_OFFSET, 0x00000000
.equ	POWMAN_BADPASSWD_BITS, 0x00000001
.equ	POWMAN_BADPASSWD_RESET, 0x00000000
.equ	POWMAN_BADPASSWD_MSB, 0
.equ	POWMAN_BADPASSWD_LSB, 0
# =============================================================================
# Register    : POWMAN_VREG_CTRL
# Description : Voltage Regulator Control
.equ	POWMAN_VREG_CTRL_OFFSET, 0x00000004
.equ	POWMAN_VREG_CTRL_BITS, 0x0000b170
.equ	POWMAN_VREG_CTRL_RESET, 0x00008050
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_CTRL_RST_N
# Description : returns the regulator to its startup settings
#               0 - reset
#               1 - not reset (default)
.equ	POWMAN_VREG_CTRL_RST_N_RESET, 0x1
.equ	POWMAN_VREG_CTRL_RST_N_BITS, 0x00008000
.equ	POWMAN_VREG_CTRL_RST_N_MSB, 15
.equ	POWMAN_VREG_CTRL_RST_N_LSB, 15
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_CTRL_UNLOCK
# Description : unlocks the VREG control interface after power up
#               0 - Locked (default)
#               1 - Unlocked
#               It cannot be relocked when it is unlocked.
.equ	POWMAN_VREG_CTRL_UNLOCK_RESET, 0x0
.equ	POWMAN_VREG_CTRL_UNLOCK_BITS, 0x00002000
.equ	POWMAN_VREG_CTRL_UNLOCK_MSB, 13
.equ	POWMAN_VREG_CTRL_UNLOCK_LSB, 13
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_CTRL_ISOLATE
# Description : isolates the VREG control interface
#               0 - not isolated (default)
#               1 - isolated
.equ	POWMAN_VREG_CTRL_ISOLATE_RESET, 0x0
.equ	POWMAN_VREG_CTRL_ISOLATE_BITS, 0x00001000
.equ	POWMAN_VREG_CTRL_ISOLATE_MSB, 12
.equ	POWMAN_VREG_CTRL_ISOLATE_LSB, 12
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT
# Description : 0=not disabled, 1=enabled
.equ	POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_RESET, 0x0
.equ	POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_BITS, 0x00000100
.equ	POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_MSB, 8
.equ	POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_LSB, 8
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_CTRL_HT_TH
# Description : high temperature protection threshold
#               regulator power transistors are disabled when junction
#               temperature exceeds threshold
#               000 - 100C
#               001 - 105C
#               010 - 110C
#               011 - 115C
#               100 - 120C
#               101 - 125C
#               110 - 135C
#               111 - 150C
.equ	POWMAN_VREG_CTRL_HT_TH_RESET, 0x5
.equ	POWMAN_VREG_CTRL_HT_TH_BITS, 0x00000070
.equ	POWMAN_VREG_CTRL_HT_TH_MSB, 6
.equ	POWMAN_VREG_CTRL_HT_TH_LSB, 4
# =============================================================================
# Register    : POWMAN_VREG_STS
# Description : Voltage Regulator Status
.equ	POWMAN_VREG_STS_OFFSET, 0x00000008
.equ	POWMAN_VREG_STS_BITS, 0x00000011
.equ	POWMAN_VREG_STS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_STS_VOUT_OK
# Description : output regulation status
#               0=not in regulation, 1=in regulation
.equ	POWMAN_VREG_STS_VOUT_OK_RESET, 0x0
.equ	POWMAN_VREG_STS_VOUT_OK_BITS, 0x00000010
.equ	POWMAN_VREG_STS_VOUT_OK_MSB, 4
.equ	POWMAN_VREG_STS_VOUT_OK_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_STS_STARTUP
# Description : startup status
#               0=startup complete, 1=starting up
.equ	POWMAN_VREG_STS_STARTUP_RESET, 0x0
.equ	POWMAN_VREG_STS_STARTUP_BITS, 0x00000001
.equ	POWMAN_VREG_STS_STARTUP_MSB, 0
.equ	POWMAN_VREG_STS_STARTUP_LSB, 0
# =============================================================================
# Register    : POWMAN_VREG
# Description : Voltage Regulator Settings
.equ	POWMAN_VREG_OFFSET, 0x0000000c
.equ	POWMAN_VREG_BITS, 0x000081f2
.equ	POWMAN_VREG_RESET, 0x000000b0
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_UPDATE_IN_PROGRESS
# Description : regulator state is being updated
#               writes to the vreg register will be ignored when this field is
#               set
.equ	POWMAN_VREG_UPDATE_IN_PROGRESS_RESET, 0x0
.equ	POWMAN_VREG_UPDATE_IN_PROGRESS_BITS, 0x00008000
.equ	POWMAN_VREG_UPDATE_IN_PROGRESS_MSB, 15
.equ	POWMAN_VREG_UPDATE_IN_PROGRESS_LSB, 15
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_VSEL
# Description : output voltage select
#               the regulator output voltage is limited to 1.3V unless the
#               voltage limit
#               is disabled using the disable_voltage_limit field in the
#               vreg_ctrl register
#               00000 - 0.55V
#               00001 - 0.60V
#               00010 - 0.65V
#               00011 - 0.70V
#               00100 - 0.75V
#               00101 - 0.80V
#               00110 - 0.85V
#               00111 - 0.90V
#               01000 - 0.95V
#               01001 - 1.00V
#               01010 - 1.05V
#               01011 - 1.10V (default)
#               01100 - 1.15V
#               01101 - 1.20V
#               01110 - 1.25V
#               01111 - 1.30V
#               10000 - 1.35V
#               10001 - 1.40V
#               10010 - 1.50V
#               10011 - 1.60V
#               10100 - 1.65V
#               10101 - 1.70V
#               10110 - 1.80V
#               10111 - 1.90V
#               11000 - 2.00V
#               11001 - 2.35V
#               11010 - 2.50V
#               11011 - 2.65V
#               11100 - 2.80V
#               11101 - 3.00V
#               11110 - 3.15V
#               11111 - 3.30V
.equ	POWMAN_VREG_VSEL_RESET, 0x0b
.equ	POWMAN_VREG_VSEL_BITS, 0x000001f0
.equ	POWMAN_VREG_VSEL_MSB, 8
.equ	POWMAN_VREG_VSEL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_HIZ
# Description : high impedance mode select
#               0=not in high impedance mode, 1=in high impedance mode
.equ	POWMAN_VREG_HIZ_RESET, 0x0
.equ	POWMAN_VREG_HIZ_BITS, 0x00000002
.equ	POWMAN_VREG_HIZ_MSB, 1
.equ	POWMAN_VREG_HIZ_LSB, 1
# =============================================================================
# Register    : POWMAN_VREG_LP_ENTRY
# Description : Voltage Regulator Low Power Entry Settings
.equ	POWMAN_VREG_LP_ENTRY_OFFSET, 0x00000010
.equ	POWMAN_VREG_LP_ENTRY_BITS, 0x000001f6
.equ	POWMAN_VREG_LP_ENTRY_RESET, 0x000000b4
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_LP_ENTRY_VSEL
# Description : output voltage select
#               the regulator output voltage is limited to 1.3V unless the
#               voltage limit
#               is disabled using the disable_voltage_limit field in the
#               vreg_ctrl register
#               00000 - 0.55V
#               00001 - 0.60V
#               00010 - 0.65V
#               00011 - 0.70V
#               00100 - 0.75V
#               00101 - 0.80V
#               00110 - 0.85V
#               00111 - 0.90V
#               01000 - 0.95V
#               01001 - 1.00V
#               01010 - 1.05V
#               01011 - 1.10V (default)
#               01100 - 1.15V
#               01101 - 1.20V
#               01110 - 1.25V
#               01111 - 1.30V
#               10000 - 1.35V
#               10001 - 1.40V
#               10010 - 1.50V
#               10011 - 1.60V
#               10100 - 1.65V
#               10101 - 1.70V
#               10110 - 1.80V
#               10111 - 1.90V
#               11000 - 2.00V
#               11001 - 2.35V
#               11010 - 2.50V
#               11011 - 2.65V
#               11100 - 2.80V
#               11101 - 3.00V
#               11110 - 3.15V
#               11111 - 3.30V
.equ	POWMAN_VREG_LP_ENTRY_VSEL_RESET, 0x0b
.equ	POWMAN_VREG_LP_ENTRY_VSEL_BITS, 0x000001f0
.equ	POWMAN_VREG_LP_ENTRY_VSEL_MSB, 8
.equ	POWMAN_VREG_LP_ENTRY_VSEL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_LP_ENTRY_MODE
# Description : selects either normal (switching) mode or low power (linear)
#               mode
#               low power mode can only be selected for output voltages up to
#               1.3V
#               0 = normal mode (switching)
#               1 = low power mode (linear)
.equ	POWMAN_VREG_LP_ENTRY_MODE_RESET, 0x1
.equ	POWMAN_VREG_LP_ENTRY_MODE_BITS, 0x00000004
.equ	POWMAN_VREG_LP_ENTRY_MODE_MSB, 2
.equ	POWMAN_VREG_LP_ENTRY_MODE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_LP_ENTRY_HIZ
# Description : high impedance mode select
#               0=not in high impedance mode, 1=in high impedance mode
.equ	POWMAN_VREG_LP_ENTRY_HIZ_RESET, 0x0
.equ	POWMAN_VREG_LP_ENTRY_HIZ_BITS, 0x00000002
.equ	POWMAN_VREG_LP_ENTRY_HIZ_MSB, 1
.equ	POWMAN_VREG_LP_ENTRY_HIZ_LSB, 1
# =============================================================================
# Register    : POWMAN_VREG_LP_EXIT
# Description : Voltage Regulator Low Power Exit Settings
.equ	POWMAN_VREG_LP_EXIT_OFFSET, 0x00000014
.equ	POWMAN_VREG_LP_EXIT_BITS, 0x000001f6
.equ	POWMAN_VREG_LP_EXIT_RESET, 0x000000b0
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_LP_EXIT_VSEL
# Description : output voltage select
#               the regulator output voltage is limited to 1.3V unless the
#               voltage limit
#               is disabled using the disable_voltage_limit field in the
#               vreg_ctrl register
#               00000 - 0.55V
#               00001 - 0.60V
#               00010 - 0.65V
#               00011 - 0.70V
#               00100 - 0.75V
#               00101 - 0.80V
#               00110 - 0.85V
#               00111 - 0.90V
#               01000 - 0.95V
#               01001 - 1.00V
#               01010 - 1.05V
#               01011 - 1.10V (default)
#               01100 - 1.15V
#               01101 - 1.20V
#               01110 - 1.25V
#               01111 - 1.30V
#               10000 - 1.35V
#               10001 - 1.40V
#               10010 - 1.50V
#               10011 - 1.60V
#               10100 - 1.65V
#               10101 - 1.70V
#               10110 - 1.80V
#               10111 - 1.90V
#               11000 - 2.00V
#               11001 - 2.35V
#               11010 - 2.50V
#               11011 - 2.65V
#               11100 - 2.80V
#               11101 - 3.00V
#               11110 - 3.15V
#               11111 - 3.30V
.equ	POWMAN_VREG_LP_EXIT_VSEL_RESET, 0x0b
.equ	POWMAN_VREG_LP_EXIT_VSEL_BITS, 0x000001f0
.equ	POWMAN_VREG_LP_EXIT_VSEL_MSB, 8
.equ	POWMAN_VREG_LP_EXIT_VSEL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_LP_EXIT_MODE
# Description : selects either normal (switching) mode or low power (linear)
#               mode
#               low power mode can only be selected for output voltages up to
#               1.3V
#               0 = normal mode (switching)
#               1 = low power mode (linear)
.equ	POWMAN_VREG_LP_EXIT_MODE_RESET, 0x0
.equ	POWMAN_VREG_LP_EXIT_MODE_BITS, 0x00000004
.equ	POWMAN_VREG_LP_EXIT_MODE_MSB, 2
.equ	POWMAN_VREG_LP_EXIT_MODE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : POWMAN_VREG_LP_EXIT_HIZ
# Description : high impedance mode select
#               0=not in high impedance mode, 1=in high impedance mode
.equ	POWMAN_VREG_LP_EXIT_HIZ_RESET, 0x0
.equ	POWMAN_VREG_LP_EXIT_HIZ_BITS, 0x00000002
.equ	POWMAN_VREG_LP_EXIT_HIZ_MSB, 1
.equ	POWMAN_VREG_LP_EXIT_HIZ_LSB, 1
# =============================================================================
# Register    : POWMAN_BOD_CTRL
# Description : Brown-out Detection Control
.equ	POWMAN_BOD_CTRL_OFFSET, 0x00000018
.equ	POWMAN_BOD_CTRL_BITS, 0x00001000
.equ	POWMAN_BOD_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : POWMAN_BOD_CTRL_ISOLATE
# Description : isolates the brown-out detection control interface
#               0 - not isolated (default)
#               1 - isolated
.equ	POWMAN_BOD_CTRL_ISOLATE_RESET, 0x0
.equ	POWMAN_BOD_CTRL_ISOLATE_BITS, 0x00001000
.equ	POWMAN_BOD_CTRL_ISOLATE_MSB, 12
.equ	POWMAN_BOD_CTRL_ISOLATE_LSB, 12
# =============================================================================
# Register    : POWMAN_BOD
# Description : Brown-out Detection Settings
.equ	POWMAN_BOD_OFFSET, 0x0000001c
.equ	POWMAN_BOD_BITS, 0x000001f1
.equ	POWMAN_BOD_RESET, 0x000000b1
# -----------------------------------------------------------------------------
# Field       : POWMAN_BOD_VSEL
# Description : threshold select
#               00000 - 0.473V
#               00001 - 0.516V
#               00010 - 0.559V
#               00011 - 0.602V
#               00100 - 0.645VS
#               00101 - 0.688V
#               00110 - 0.731V
#               00111 - 0.774V
#               01000 - 0.817V
#               01001 - 0.860V (default)
#               01010 - 0.903V
#               01011 - 0.946V
#               01100 - 0.989V
#               01101 - 1.032V
#               01110 - 1.075V
#               01111 - 1.118V
#               10000 - 1.161
#               10001 - 1.204V
.equ	POWMAN_BOD_VSEL_RESET, 0x0b
.equ	POWMAN_BOD_VSEL_BITS, 0x000001f0
.equ	POWMAN_BOD_VSEL_MSB, 8
.equ	POWMAN_BOD_VSEL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_BOD_EN
# Description : enable brown-out detection
#               0=not enabled, 1=enabled
.equ	POWMAN_BOD_EN_RESET, 0x1
.equ	POWMAN_BOD_EN_BITS, 0x00000001
.equ	POWMAN_BOD_EN_MSB, 0
.equ	POWMAN_BOD_EN_LSB, 0
# =============================================================================
# Register    : POWMAN_BOD_LP_ENTRY
# Description : Brown-out Detection Low Power Entry Settings
.equ	POWMAN_BOD_LP_ENTRY_OFFSET, 0x00000020
.equ	POWMAN_BOD_LP_ENTRY_BITS, 0x000001f1
.equ	POWMAN_BOD_LP_ENTRY_RESET, 0x000000b0
# -----------------------------------------------------------------------------
# Field       : POWMAN_BOD_LP_ENTRY_VSEL
# Description : threshold select
#               00000 - 0.473V
#               00001 - 0.516V
#               00010 - 0.559V
#               00011 - 0.602V
#               00100 - 0.645VS
#               00101 - 0.688V
#               00110 - 0.731V
#               00111 - 0.774V
#               01000 - 0.817V
#               01001 - 0.860V (default)
#               01010 - 0.903V
#               01011 - 0.946V
#               01100 - 0.989V
#               01101 - 1.032V
#               01110 - 1.075V
#               01111 - 1.118V
#               10000 - 1.161
#               10001 - 1.204V
.equ	POWMAN_BOD_LP_ENTRY_VSEL_RESET, 0x0b
.equ	POWMAN_BOD_LP_ENTRY_VSEL_BITS, 0x000001f0
.equ	POWMAN_BOD_LP_ENTRY_VSEL_MSB, 8
.equ	POWMAN_BOD_LP_ENTRY_VSEL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_BOD_LP_ENTRY_EN
# Description : enable brown-out detection
#               0=not enabled, 1=enabled
.equ	POWMAN_BOD_LP_ENTRY_EN_RESET, 0x0
.equ	POWMAN_BOD_LP_ENTRY_EN_BITS, 0x00000001
.equ	POWMAN_BOD_LP_ENTRY_EN_MSB, 0
.equ	POWMAN_BOD_LP_ENTRY_EN_LSB, 0
# =============================================================================
# Register    : POWMAN_BOD_LP_EXIT
# Description : Brown-out Detection Low Power Exit Settings
.equ	POWMAN_BOD_LP_EXIT_OFFSET, 0x00000024
.equ	POWMAN_BOD_LP_EXIT_BITS, 0x000001f1
.equ	POWMAN_BOD_LP_EXIT_RESET, 0x000000b1
# -----------------------------------------------------------------------------
# Field       : POWMAN_BOD_LP_EXIT_VSEL
# Description : threshold select
#               00000 - 0.473V
#               00001 - 0.516V
#               00010 - 0.559V
#               00011 - 0.602V
#               00100 - 0.645VS
#               00101 - 0.688V
#               00110 - 0.731V
#               00111 - 0.774V
#               01000 - 0.817V
#               01001 - 0.860V (default)
#               01010 - 0.903V
#               01011 - 0.946V
#               01100 - 0.989V
#               01101 - 1.032V
#               01110 - 1.075V
#               01111 - 1.118V
#               10000 - 1.161
#               10001 - 1.204V
.equ	POWMAN_BOD_LP_EXIT_VSEL_RESET, 0x0b
.equ	POWMAN_BOD_LP_EXIT_VSEL_BITS, 0x000001f0
.equ	POWMAN_BOD_LP_EXIT_VSEL_MSB, 8
.equ	POWMAN_BOD_LP_EXIT_VSEL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_BOD_LP_EXIT_EN
# Description : enable brown-out detection
#               0=not enabled, 1=enabled
.equ	POWMAN_BOD_LP_EXIT_EN_RESET, 0x1
.equ	POWMAN_BOD_LP_EXIT_EN_BITS, 0x00000001
.equ	POWMAN_BOD_LP_EXIT_EN_MSB, 0
.equ	POWMAN_BOD_LP_EXIT_EN_LSB, 0
# =============================================================================
# Register    : POWMAN_LPOSC
# Description : Low power oscillator control register.
.equ	POWMAN_LPOSC_OFFSET, 0x00000028
.equ	POWMAN_LPOSC_BITS, 0x000003f3
.equ	POWMAN_LPOSC_RESET, 0x00000203
# -----------------------------------------------------------------------------
# Field       : POWMAN_LPOSC_TRIM
# Description : Frequency trim - the trim step is typically 1% of the reset
#               frequency, but can be up to 3%
.equ	POWMAN_LPOSC_TRIM_RESET, 0x20
.equ	POWMAN_LPOSC_TRIM_BITS, 0x000003f0
.equ	POWMAN_LPOSC_TRIM_MSB, 9
.equ	POWMAN_LPOSC_TRIM_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_LPOSC_MODE
# Description : This feature has been removed
.equ	POWMAN_LPOSC_MODE_RESET, 0x3
.equ	POWMAN_LPOSC_MODE_BITS, 0x00000003
.equ	POWMAN_LPOSC_MODE_MSB, 1
.equ	POWMAN_LPOSC_MODE_LSB, 0
# =============================================================================
# Register    : POWMAN_CHIP_RESET
# Description : Chip reset control and status
.equ	POWMAN_CHIP_RESET_OFFSET, 0x0000002c
.equ	POWMAN_CHIP_RESET_BITS, 0x1fef0011
.equ	POWMAN_CHIP_RESET_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM
# Description : Last reset was a watchdog timeout which was configured to reset
#               the power-on state machine
#               This resets:
#               double_tap flag    no
#               DP                 no
#               RPAP               no
#               rescue_flag        no
#               timer              no
#               powman             no
#               swcore             no
#               psm                yes
#               and does not change the power state
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_RESET, 0x0
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_BITS, 0x10000000
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_MSB, 28
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_LSB, 28
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ
# Description : Last reset was a system reset from the hazard debugger
#               This resets:
#               double_tap flag    no
#               DP                 no
#               RPAP               no
#               rescue_flag        no
#               timer              no
#               powman             no
#               swcore             no
#               psm                yes
#               and does not change the power state
.equ	POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_RESET, 0x0
.equ	POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_BITS, 0x08000000
.equ	POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_MSB, 27
.equ	POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_LSB, 27
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_HAD_GLITCH_DETECT
# Description : Last reset was due to a power supply glitch
#               This resets:
#               double_tap flag    no
#               DP                 no
#               RPAP               no
#               rescue_flag        no
#               timer              no
#               powman             no
#               swcore             no
#               psm                yes
#               and does not change the power state
.equ	POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_RESET, 0x0
.equ	POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_BITS, 0x04000000
.equ	POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_MSB, 26
.equ	POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_LSB, 26
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_HAD_SWCORE_PD
# Description : Last reset was a switched core powerdown
#               This resets:
#               double_tap flag    no
#               DP                 no
#               RPAP               no
#               rescue_flag        no
#               timer              no
#               powman             no
#               swcore             yes
#               psm                yes
#               then starts the power sequencer
.equ	POWMAN_CHIP_RESET_HAD_SWCORE_PD_RESET, 0x0
.equ	POWMAN_CHIP_RESET_HAD_SWCORE_PD_BITS, 0x02000000
.equ	POWMAN_CHIP_RESET_HAD_SWCORE_PD_MSB, 25
.equ	POWMAN_CHIP_RESET_HAD_SWCORE_PD_LSB, 25
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE
# Description : Last reset was a watchdog timeout which was configured to reset
#               the switched-core
#               This resets:
#               double_tap flag    no
#               DP                 no
#               RPAP               no
#               rescue_flag        no
#               timer              no
#               powman             no
#               swcore             yes
#               psm                yes
#               then starts the power sequencer
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_RESET, 0x0
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_BITS, 0x01000000
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_MSB, 24
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_LSB, 24
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN
# Description : Last reset was a watchdog timeout which was configured to reset
#               the power manager
#               This resets:
#               double_tap flag    no
#               DP                 no
#               RPAP               no
#               rescue_flag        no
#               timer              yes
#               powman             yes
#               swcore             yes
#               psm                yes
#               then starts the power sequencer
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_RESET, 0x0
