konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/powman.inc
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_BITS, 0x00800000
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_MSB, 23
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_LSB, 23
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC
# Description : Last reset was a watchdog timeout which was configured to reset
#               the power manager asynchronously
#               This resets:
#               double_tap flag    no
#               DP                 no
#               RPAP               no
#               rescue_flag        no
#               timer              yes
#               powman             yes
#               swcore             yes
#               psm                yes
#               then starts the power sequencer
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_RESET, 0x0
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_BITS, 0x00400000
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_MSB, 22
.equ	POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_LSB, 22
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_HAD_RESCUE
# Description : Last reset was a rescue reset from the debugger
#               This resets:
#               double_tap flag    no
#               DP                 no
#               RPAP               no
#               rescue_flag        no, it sets this flag
#               timer              yes
#               powman             yes
#               swcore             yes
#               psm                yes
#               then starts the power sequencer
.equ	POWMAN_CHIP_RESET_HAD_RESCUE_RESET, 0x0
.equ	POWMAN_CHIP_RESET_HAD_RESCUE_BITS, 0x00200000
.equ	POWMAN_CHIP_RESET_HAD_RESCUE_MSB, 21
.equ	POWMAN_CHIP_RESET_HAD_RESCUE_LSB, 21
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_HAD_DP_RESET_REQ
# Description : Last reset was an reset request from the arm debugger
#               This resets:
#               double_tap flag    no
#               DP                 no
#               RPAP               no
#               rescue_flag        yes
#               timer              yes
#               powman             yes
#               swcore             yes
#               psm                yes
#               then starts the power sequencer
.equ	POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_RESET, 0x0
.equ	POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_BITS, 0x00080000
.equ	POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_MSB, 19
.equ	POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_LSB, 19
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_HAD_RUN_LOW
# Description : Last reset was from the RUN pin
#               This resets:
#               double_tap flag    no
#               DP                 yes
#               RPAP               yes
#               rescue_flag        yes
#               timer              yes
#               powman             yes
#               swcore             yes
#               psm                yes
#               then starts the power sequencer
.equ	POWMAN_CHIP_RESET_HAD_RUN_LOW_RESET, 0x0
.equ	POWMAN_CHIP_RESET_HAD_RUN_LOW_BITS, 0x00040000
.equ	POWMAN_CHIP_RESET_HAD_RUN_LOW_MSB, 18
.equ	POWMAN_CHIP_RESET_HAD_RUN_LOW_LSB, 18
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_HAD_BOR
# Description : Last reset was from the brown-out detection block
#               This resets:
#               double_tap flag    yes
#               DP                 yes
#               RPAP               yes
#               rescue_flag        yes
#               timer              yes
#               powman             yes
#               swcore             yes
#               psm                yes
#               then starts the power sequencer
.equ	POWMAN_CHIP_RESET_HAD_BOR_RESET, 0x0
.equ	POWMAN_CHIP_RESET_HAD_BOR_BITS, 0x00020000
.equ	POWMAN_CHIP_RESET_HAD_BOR_MSB, 17
.equ	POWMAN_CHIP_RESET_HAD_BOR_LSB, 17
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_HAD_POR
# Description : Last reset was from the power-on reset
#               This resets:
#               double_tap flag    yes
#               DP                 yes
#               RPAP               yes
#               rescue_flag        yes
#               timer              yes
#               powman             yes
#               swcore             yes
#               psm                yes
#               then starts the power sequencer
.equ	POWMAN_CHIP_RESET_HAD_POR_RESET, 0x0
.equ	POWMAN_CHIP_RESET_HAD_POR_BITS, 0x00010000
.equ	POWMAN_CHIP_RESET_HAD_POR_MSB, 16
.equ	POWMAN_CHIP_RESET_HAD_POR_LSB, 16
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_RESCUE_FLAG
# Description : This is set by a rescue reset from the RP-AP.
#               Its purpose is to halt before the bootrom before booting from
#               flash in order to recover from a boot lock-up.
#               The debugger can then attach once the bootrom has been halted
#               and flash some working code that does not lock up.
.equ	POWMAN_CHIP_RESET_RESCUE_FLAG_RESET, 0x0
.equ	POWMAN_CHIP_RESET_RESCUE_FLAG_BITS, 0x00000010
.equ	POWMAN_CHIP_RESET_RESCUE_FLAG_MSB, 4
.equ	POWMAN_CHIP_RESET_RESCUE_FLAG_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_CHIP_RESET_DOUBLE_TAP
# Description : This flag is set by double-tapping RUN. It tells bootcode to go
#               into the bootloader.
.equ	POWMAN_CHIP_RESET_DOUBLE_TAP_RESET, 0x0
.equ	POWMAN_CHIP_RESET_DOUBLE_TAP_BITS, 0x00000001
.equ	POWMAN_CHIP_RESET_DOUBLE_TAP_MSB, 0
.equ	POWMAN_CHIP_RESET_DOUBLE_TAP_LSB, 0
# =============================================================================
# Register    : POWMAN_WDSEL
# Description : Allows a watchdog reset to reset the internal state of powman
#               in addition to the power-on state machine (PSM).
#               Note that powman ignores watchdog resets that do not select at
#               least the CLOCKS stage or earlier stages in the PSM. If using
#               these bits, it's recommended to set PSM_WDSEL to all-ones in
#               addition to the desired bits in this register. Failing to
#               select CLOCKS or earlier will result in the POWMAN_WDSEL
#               register having no effect.
.equ	POWMAN_WDSEL_OFFSET, 0x00000030
.equ	POWMAN_WDSEL_BITS, 0x00001111
.equ	POWMAN_WDSEL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : POWMAN_WDSEL_RESET_RSM
# Description : If set to 1, a watchdog reset will run the full power-on state
#               machine (PSM) sequence
#               From a user perspective it is the same as setting
#               RSM_WDSEL_PROC_COLD
#               From a hardware debug perspective it has the same effect as a
#               reset from a glitch detector
.equ	POWMAN_WDSEL_RESET_RSM_RESET, 0x0
.equ	POWMAN_WDSEL_RESET_RSM_BITS, 0x00001000
.equ	POWMAN_WDSEL_RESET_RSM_MSB, 12
.equ	POWMAN_WDSEL_RESET_RSM_LSB, 12
# -----------------------------------------------------------------------------
# Field       : POWMAN_WDSEL_RESET_SWCORE
# Description : If set to 1, a watchdog reset will reset the switched core
#               power domain and run the full power-on state machine (PSM)
#               sequence
#               From a user perspective it is the same as setting
#               RSM_WDSEL_PROC_COLD
#               From a hardware debug perspective it has the same effect as a
#               power-on reset for the switched core power domain
.equ	POWMAN_WDSEL_RESET_SWCORE_RESET, 0x0
.equ	POWMAN_WDSEL_RESET_SWCORE_BITS, 0x00000100
.equ	POWMAN_WDSEL_RESET_SWCORE_MSB, 8
.equ	POWMAN_WDSEL_RESET_SWCORE_LSB, 8
# -----------------------------------------------------------------------------
# Field       : POWMAN_WDSEL_RESET_POWMAN
# Description : If set to 1, a watchdog reset will restore powman defaults,
#               reset the timer, reset the switched core power domain
#               and run the full power-on state machine (PSM) sequence
#               This relies on clk_ref running. Use reset_powman_async if that
#               may not be true
.equ	POWMAN_WDSEL_RESET_POWMAN_RESET, 0x0
.equ	POWMAN_WDSEL_RESET_POWMAN_BITS, 0x00000010
.equ	POWMAN_WDSEL_RESET_POWMAN_MSB, 4
.equ	POWMAN_WDSEL_RESET_POWMAN_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_WDSEL_RESET_POWMAN_ASYNC
# Description : If set to 1, a watchdog reset will restore powman defaults,
#               reset the timer,
#               reset the switched core domain and run the full power-on state
#               machine (PSM) sequence
#               This does not rely on clk_ref running
.equ	POWMAN_WDSEL_RESET_POWMAN_ASYNC_RESET, 0x0
.equ	POWMAN_WDSEL_RESET_POWMAN_ASYNC_BITS, 0x00000001
.equ	POWMAN_WDSEL_RESET_POWMAN_ASYNC_MSB, 0
.equ	POWMAN_WDSEL_RESET_POWMAN_ASYNC_LSB, 0
# =============================================================================
# Register    : POWMAN_SEQ_CFG
# Description : For configuration of the power sequencer
#               Writes are ignored while POWMAN_STATE_CHANGING=1
.equ	POWMAN_SEQ_CFG_OFFSET, 0x00000034
.equ	POWMAN_SEQ_CFG_BITS, 0x001311f3
.equ	POWMAN_SEQ_CFG_RESET, 0x001011f0
# -----------------------------------------------------------------------------
# Field       : POWMAN_SEQ_CFG_USING_FAST_POWCK
# Description : 0 indicates the POWMAN clock is running from the low power
#               oscillator (32kHz)
#               1 indicates the POWMAN clock is running from the reference
#               clock (2-50MHz)
.equ	POWMAN_SEQ_CFG_USING_FAST_POWCK_RESET, 0x1
.equ	POWMAN_SEQ_CFG_USING_FAST_POWCK_BITS, 0x00100000
.equ	POWMAN_SEQ_CFG_USING_FAST_POWCK_MSB, 20
.equ	POWMAN_SEQ_CFG_USING_FAST_POWCK_LSB, 20
# -----------------------------------------------------------------------------
# Field       : POWMAN_SEQ_CFG_USING_BOD_LP
# Description : Indicates the brown-out detector (BOD) mode
#               0 = BOD high power mode which is the default
#               1 = BOD low power mode
.equ	POWMAN_SEQ_CFG_USING_BOD_LP_RESET, 0x0
.equ	POWMAN_SEQ_CFG_USING_BOD_LP_BITS, 0x00020000
.equ	POWMAN_SEQ_CFG_USING_BOD_LP_MSB, 17
.equ	POWMAN_SEQ_CFG_USING_BOD_LP_LSB, 17
# -----------------------------------------------------------------------------
# Field       : POWMAN_SEQ_CFG_USING_VREG_LP
# Description : Indicates the voltage regulator (VREG) mode
#               0 = VREG high power mode which is the default
#               1 = VREG low power mode
.equ	POWMAN_SEQ_CFG_USING_VREG_LP_RESET, 0x0
.equ	POWMAN_SEQ_CFG_USING_VREG_LP_BITS, 0x00010000
.equ	POWMAN_SEQ_CFG_USING_VREG_LP_MSB, 16
.equ	POWMAN_SEQ_CFG_USING_VREG_LP_LSB, 16
# -----------------------------------------------------------------------------
# Field       : POWMAN_SEQ_CFG_USE_FAST_POWCK
# Description : selects the reference clock (clk_ref) as the source of the
#               POWMAN clock when switched-core is powered. The POWMAN clock
#               always switches to the slow clock (lposc) when switched-core is
#               powered down because the fast clock stops running.
#               0 always run the POWMAN clock from the slow clock (lposc)
#               1 run the POWMAN clock from the fast clock when available
#               This setting takes effect when a power up sequence is next run
.equ	POWMAN_SEQ_CFG_USE_FAST_POWCK_RESET, 0x1
.equ	POWMAN_SEQ_CFG_USE_FAST_POWCK_BITS, 0x00001000
.equ	POWMAN_SEQ_CFG_USE_FAST_POWCK_MSB, 12
.equ	POWMAN_SEQ_CFG_USE_FAST_POWCK_LSB, 12
# -----------------------------------------------------------------------------
# Field       : POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP
# Description : Set to 0 to stop the low power osc when the switched-core is
#               powered down, which is unwise if using it to clock the timer
#               This setting takes effect when the swcore is next powered down
.equ	POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_RESET, 0x1
.equ	POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_BITS, 0x00000100
.equ	POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_MSB, 8
.equ	POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_LSB, 8
# -----------------------------------------------------------------------------
# Field       : POWMAN_SEQ_CFG_USE_BOD_HP
# Description : Set to 0 to prevent automatic switching to bod high power mode
#               when switched-core is powered up
#               This setting takes effect when the swcore is next powered up
.equ	POWMAN_SEQ_CFG_USE_BOD_HP_RESET, 0x1
.equ	POWMAN_SEQ_CFG_USE_BOD_HP_BITS, 0x00000080
.equ	POWMAN_SEQ_CFG_USE_BOD_HP_MSB, 7
.equ	POWMAN_SEQ_CFG_USE_BOD_HP_LSB, 7
# -----------------------------------------------------------------------------
# Field       : POWMAN_SEQ_CFG_USE_BOD_LP
# Description : Set to 0 to prevent automatic switching to bod low power mode
#               when switched-core is powered down
#               This setting takes effect when the swcore is next powered down
.equ	POWMAN_SEQ_CFG_USE_BOD_LP_RESET, 0x1
.equ	POWMAN_SEQ_CFG_USE_BOD_LP_BITS, 0x00000040
.equ	POWMAN_SEQ_CFG_USE_BOD_LP_MSB, 6
.equ	POWMAN_SEQ_CFG_USE_BOD_LP_LSB, 6
# -----------------------------------------------------------------------------
# Field       : POWMAN_SEQ_CFG_USE_VREG_HP
# Description : Set to 0 to prevent automatic switching to vreg high power mode
#               when switched-core is powered up
#               This setting takes effect when the swcore is next powered up
.equ	POWMAN_SEQ_CFG_USE_VREG_HP_RESET, 0x1
.equ	POWMAN_SEQ_CFG_USE_VREG_HP_BITS, 0x00000020
.equ	POWMAN_SEQ_CFG_USE_VREG_HP_MSB, 5
.equ	POWMAN_SEQ_CFG_USE_VREG_HP_LSB, 5
# -----------------------------------------------------------------------------
# Field       : POWMAN_SEQ_CFG_USE_VREG_LP
# Description : Set to 0 to prevent automatic switching to vreg low power mode
#               when switched-core is powered down
#               This setting takes effect when the swcore is next powered down
.equ	POWMAN_SEQ_CFG_USE_VREG_LP_RESET, 0x1
.equ	POWMAN_SEQ_CFG_USE_VREG_LP_BITS, 0x00000010
.equ	POWMAN_SEQ_CFG_USE_VREG_LP_MSB, 4
.equ	POWMAN_SEQ_CFG_USE_VREG_LP_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_SEQ_CFG_HW_PWRUP_SRAM0
# Description : Specifies the power state of SRAM0 when powering up swcore from
#               a low power state (P1.xxx) to a high power state (P0.0xx).
#               0=power-up
#               1=no change
.equ	POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_RESET, 0x0
.equ	POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_BITS, 0x00000002
.equ	POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_MSB, 1
.equ	POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_LSB, 1
# -----------------------------------------------------------------------------
# Field       : POWMAN_SEQ_CFG_HW_PWRUP_SRAM1
# Description : Specifies the power state of SRAM1 when powering up swcore from
#               a low power state (P1.xxx) to a high power state (P0.0xx).
#               0=power-up
#               1=no change
.equ	POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_RESET, 0x0
.equ	POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_BITS, 0x00000001
.equ	POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_MSB, 0
.equ	POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_LSB, 0
# =============================================================================
# Register    : POWMAN_STATE
# Description : This register controls the power state of the 4 power domains.
#               The current power state is indicated in POWMAN_STATE_CURRENT
#               which is read-only.
#               To change the state, write to POWMAN_STATE_REQ.
#               The coding of POWMAN_STATE_CURRENT & POWMAN_STATE_REQ
#               corresponds to the power states
#               defined in the datasheet:
#               bit 3 = SWCORE
#               bit 2 = XIP cache
#               bit 1 = SRAM0
#               bit 0 = SRAM1
#               0 = powered up
#               1 = powered down
#               When POWMAN_STATE_REQ is written, the POWMAN_STATE_WAITING flag
#               is set while the Power Manager determines what is required. If
#               an invalid transition is requested the Power Manager will still
#               register the request in POWMAN_STATE_REQ but will also set the
#               POWMAN_BAD_REQ flag. It will then implement the power-up
#               requests and ignore the power down requests. To do nothing
#               would risk entering an unrecoverable lock-up state. Invalid
#               requests are: any combination of power up and power down
#               requests any request that results in swcore boing powered and
#               xip unpowered If the request is to power down the switched-core
#               domain then POWMAN_STATE_WAITING stays active until the
#               processors halt. During this time the POWMAN_STATE_REQ field
#               can be re-written to change or cancel the request. When the
#               power state transition begins the POWMAN_STATE_WAITING_flag is
#               cleared, the POWMAN_STATE_CHANGING flag is set and POWMAN
#               register writes are ignored until the transition completes.
.equ	POWMAN_STATE_OFFSET, 0x00000038
.equ	POWMAN_STATE_BITS, 0x00003fff
.equ	POWMAN_STATE_RESET, 0x0000000f
# -----------------------------------------------------------------------------
# Field       : POWMAN_STATE_CHANGING
.equ	POWMAN_STATE_CHANGING_RESET, 0x0
.equ	POWMAN_STATE_CHANGING_BITS, 0x00002000
.equ	POWMAN_STATE_CHANGING_MSB, 13
.equ	POWMAN_STATE_CHANGING_LSB, 13
# -----------------------------------------------------------------------------
# Field       : POWMAN_STATE_WAITING
.equ	POWMAN_STATE_WAITING_RESET, 0x0
.equ	POWMAN_STATE_WAITING_BITS, 0x00001000
.equ	POWMAN_STATE_WAITING_MSB, 12
.equ	POWMAN_STATE_WAITING_LSB, 12
# -----------------------------------------------------------------------------
# Field       : POWMAN_STATE_BAD_HW_REQ
# Description : Bad hardware initiated state request. Went back to state 0
#               (i.e. everything powered up)
.equ	POWMAN_STATE_BAD_HW_REQ_RESET, 0x0
.equ	POWMAN_STATE_BAD_HW_REQ_BITS, 0x00000800
.equ	POWMAN_STATE_BAD_HW_REQ_MSB, 11
.equ	POWMAN_STATE_BAD_HW_REQ_LSB, 11
# -----------------------------------------------------------------------------
# Field       : POWMAN_STATE_BAD_SW_REQ
# Description : Bad software initiated state request. No action taken.
.equ	POWMAN_STATE_BAD_SW_REQ_RESET, 0x0
.equ	POWMAN_STATE_BAD_SW_REQ_BITS, 0x00000400
.equ	POWMAN_STATE_BAD_SW_REQ_MSB, 10
.equ	POWMAN_STATE_BAD_SW_REQ_LSB, 10
# -----------------------------------------------------------------------------
# Field       : POWMAN_STATE_PWRUP_WHILE_WAITING
# Description : Request ignored because of a pending pwrup request. See
#               current_pwrup_req. Note this blocks powering up AND powering
#               down.
.equ	POWMAN_STATE_PWRUP_WHILE_WAITING_RESET, 0x0
.equ	POWMAN_STATE_PWRUP_WHILE_WAITING_BITS, 0x00000200
.equ	POWMAN_STATE_PWRUP_WHILE_WAITING_MSB, 9
.equ	POWMAN_STATE_PWRUP_WHILE_WAITING_LSB, 9
# -----------------------------------------------------------------------------
# Field       : POWMAN_STATE_REQ_IGNORED
.equ	POWMAN_STATE_REQ_IGNORED_RESET, 0x0
.equ	POWMAN_STATE_REQ_IGNORED_BITS, 0x00000100
.equ	POWMAN_STATE_REQ_IGNORED_MSB, 8
.equ	POWMAN_STATE_REQ_IGNORED_LSB, 8
# -----------------------------------------------------------------------------
# Field       : POWMAN_STATE_REQ
.equ	POWMAN_STATE_REQ_RESET, 0x0
.equ	POWMAN_STATE_REQ_BITS, 0x000000f0
.equ	POWMAN_STATE_REQ_MSB, 7
.equ	POWMAN_STATE_REQ_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_STATE_CURRENT
.equ	POWMAN_STATE_CURRENT_RESET, 0xf
.equ	POWMAN_STATE_CURRENT_BITS, 0x0000000f
.equ	POWMAN_STATE_CURRENT_MSB, 3
.equ	POWMAN_STATE_CURRENT_LSB, 0
# =============================================================================
# Register    : POWMAN_POW_FASTDIV
# Description : None
#               divides the POWMAN clock to provide a tick for the delay module
#               and state machines
#               when clk_pow is running from the slow clock it is not divided
#               when clk_pow is running from the fast clock it is divided by
#               tick_div
.equ	POWMAN_POW_FASTDIV_OFFSET, 0x0000003c
.equ	POWMAN_POW_FASTDIV_BITS, 0x000007ff
.equ	POWMAN_POW_FASTDIV_RESET, 0x00000040
.equ	POWMAN_POW_FASTDIV_MSB, 10
.equ	POWMAN_POW_FASTDIV_LSB, 0
# =============================================================================
# Register    : POWMAN_POW_DELAY
# Description : power state machine delays
.equ	POWMAN_POW_DELAY_OFFSET, 0x00000040
.equ	POWMAN_POW_DELAY_BITS, 0x0000ffff
.equ	POWMAN_POW_DELAY_RESET, 0x00002011
# -----------------------------------------------------------------------------
# Field       : POWMAN_POW_DELAY_SRAM_STEP
# Description : timing between the sram0 and sram1 power state machine steps
#               measured in units of the powman tick period (>=1us), 0 gives a
#               delay of 1 unit
.equ	POWMAN_POW_DELAY_SRAM_STEP_RESET, 0x20
.equ	POWMAN_POW_DELAY_SRAM_STEP_BITS, 0x0000ff00
.equ	POWMAN_POW_DELAY_SRAM_STEP_MSB, 15
.equ	POWMAN_POW_DELAY_SRAM_STEP_LSB, 8
# -----------------------------------------------------------------------------
# Field       : POWMAN_POW_DELAY_XIP_STEP
# Description : timing between the xip power state machine steps
#               measured in units of the lposc period, 0 gives a delay of 1
#               unit
.equ	POWMAN_POW_DELAY_XIP_STEP_RESET, 0x1
.equ	POWMAN_POW_DELAY_XIP_STEP_BITS, 0x000000f0
.equ	POWMAN_POW_DELAY_XIP_STEP_MSB, 7
.equ	POWMAN_POW_DELAY_XIP_STEP_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_POW_DELAY_SWCORE_STEP
# Description : timing between the swcore power state machine steps
#               measured in units of the lposc period, 0 gives a delay of 1
#               unit
.equ	POWMAN_POW_DELAY_SWCORE_STEP_RESET, 0x1
.equ	POWMAN_POW_DELAY_SWCORE_STEP_BITS, 0x0000000f
.equ	POWMAN_POW_DELAY_SWCORE_STEP_MSB, 3
.equ	POWMAN_POW_DELAY_SWCORE_STEP_LSB, 0
# =============================================================================
# Register    : POWMAN_EXT_CTRL0
# Description : Configures a gpio as a power mode aware control output
.equ	POWMAN_EXT_CTRL0_OFFSET, 0x00000044
.equ	POWMAN_EXT_CTRL0_BITS, 0x0000713f
.equ	POWMAN_EXT_CTRL0_RESET, 0x0000003f
# -----------------------------------------------------------------------------
# Field       : POWMAN_EXT_CTRL0_LP_EXIT_STATE
# Description : output level when exiting the low power state
.equ	POWMAN_EXT_CTRL0_LP_EXIT_STATE_RESET, 0x0
.equ	POWMAN_EXT_CTRL0_LP_EXIT_STATE_BITS, 0x00004000
.equ	POWMAN_EXT_CTRL0_LP_EXIT_STATE_MSB, 14
.equ	POWMAN_EXT_CTRL0_LP_EXIT_STATE_LSB, 14
# -----------------------------------------------------------------------------
# Field       : POWMAN_EXT_CTRL0_LP_ENTRY_STATE
# Description : output level when entering the low power state
.equ	POWMAN_EXT_CTRL0_LP_ENTRY_STATE_RESET, 0x0
.equ	POWMAN_EXT_CTRL0_LP_ENTRY_STATE_BITS, 0x00002000
.equ	POWMAN_EXT_CTRL0_LP_ENTRY_STATE_MSB, 13
.equ	POWMAN_EXT_CTRL0_LP_ENTRY_STATE_LSB, 13
# -----------------------------------------------------------------------------
# Field       : POWMAN_EXT_CTRL0_INIT_STATE
.equ	POWMAN_EXT_CTRL0_INIT_STATE_RESET, 0x0
.equ	POWMAN_EXT_CTRL0_INIT_STATE_BITS, 0x00001000
.equ	POWMAN_EXT_CTRL0_INIT_STATE_MSB, 12
.equ	POWMAN_EXT_CTRL0_INIT_STATE_LSB, 12
# -----------------------------------------------------------------------------
# Field       : POWMAN_EXT_CTRL0_INIT
.equ	POWMAN_EXT_CTRL0_INIT_RESET, 0x0
.equ	POWMAN_EXT_CTRL0_INIT_BITS, 0x00000100
