konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/powman.inc
.equ	POWMAN_EXT_CTRL0_INIT_MSB, 8
.equ	POWMAN_EXT_CTRL0_INIT_LSB, 8
# -----------------------------------------------------------------------------
# Field       : POWMAN_EXT_CTRL0_GPIO_SELECT
# Description : selects from gpio 0->30
#               set to 31 to disable this feature
.equ	POWMAN_EXT_CTRL0_GPIO_SELECT_RESET, 0x3f
.equ	POWMAN_EXT_CTRL0_GPIO_SELECT_BITS, 0x0000003f
.equ	POWMAN_EXT_CTRL0_GPIO_SELECT_MSB, 5
.equ	POWMAN_EXT_CTRL0_GPIO_SELECT_LSB, 0
# =============================================================================
# Register    : POWMAN_EXT_CTRL1
# Description : Configures a gpio as a power mode aware control output
.equ	POWMAN_EXT_CTRL1_OFFSET, 0x00000048
.equ	POWMAN_EXT_CTRL1_BITS, 0x0000713f
.equ	POWMAN_EXT_CTRL1_RESET, 0x0000003f
# -----------------------------------------------------------------------------
# Field       : POWMAN_EXT_CTRL1_LP_EXIT_STATE
# Description : output level when exiting the low power state
.equ	POWMAN_EXT_CTRL1_LP_EXIT_STATE_RESET, 0x0
.equ	POWMAN_EXT_CTRL1_LP_EXIT_STATE_BITS, 0x00004000
.equ	POWMAN_EXT_CTRL1_LP_EXIT_STATE_MSB, 14
.equ	POWMAN_EXT_CTRL1_LP_EXIT_STATE_LSB, 14
# -----------------------------------------------------------------------------
# Field       : POWMAN_EXT_CTRL1_LP_ENTRY_STATE
# Description : output level when entering the low power state
.equ	POWMAN_EXT_CTRL1_LP_ENTRY_STATE_RESET, 0x0
.equ	POWMAN_EXT_CTRL1_LP_ENTRY_STATE_BITS, 0x00002000
.equ	POWMAN_EXT_CTRL1_LP_ENTRY_STATE_MSB, 13
.equ	POWMAN_EXT_CTRL1_LP_ENTRY_STATE_LSB, 13
# -----------------------------------------------------------------------------
# Field       : POWMAN_EXT_CTRL1_INIT_STATE
.equ	POWMAN_EXT_CTRL1_INIT_STATE_RESET, 0x0
.equ	POWMAN_EXT_CTRL1_INIT_STATE_BITS, 0x00001000
.equ	POWMAN_EXT_CTRL1_INIT_STATE_MSB, 12
.equ	POWMAN_EXT_CTRL1_INIT_STATE_LSB, 12
# -----------------------------------------------------------------------------
# Field       : POWMAN_EXT_CTRL1_INIT
.equ	POWMAN_EXT_CTRL1_INIT_RESET, 0x0
.equ	POWMAN_EXT_CTRL1_INIT_BITS, 0x00000100
.equ	POWMAN_EXT_CTRL1_INIT_MSB, 8
.equ	POWMAN_EXT_CTRL1_INIT_LSB, 8
# -----------------------------------------------------------------------------
# Field       : POWMAN_EXT_CTRL1_GPIO_SELECT
# Description : selects from gpio 0->30
#               set to 31 to disable this feature
.equ	POWMAN_EXT_CTRL1_GPIO_SELECT_RESET, 0x3f
.equ	POWMAN_EXT_CTRL1_GPIO_SELECT_BITS, 0x0000003f
.equ	POWMAN_EXT_CTRL1_GPIO_SELECT_MSB, 5
.equ	POWMAN_EXT_CTRL1_GPIO_SELECT_LSB, 0
# =============================================================================
# Register    : POWMAN_EXT_TIME_REF
# Description : Select a GPIO to use as a time reference, the source can be
#               used to drive the low power clock at 32kHz, or to provide a 1ms
#               tick to the timer, or provide a 1Hz tick to the timer. The tick
#               selection is controlled by the POWMAN_TIMER register.
.equ	POWMAN_EXT_TIME_REF_OFFSET, 0x0000004c
.equ	POWMAN_EXT_TIME_REF_BITS, 0x00000013
.equ	POWMAN_EXT_TIME_REF_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : POWMAN_EXT_TIME_REF_DRIVE_LPCK
# Description : Use the selected GPIO to drive the 32kHz low power clock, in
#               place of LPOSC. This field must only be written when
#               POWMAN_TIMER_RUN=0
.equ	POWMAN_EXT_TIME_REF_DRIVE_LPCK_RESET, 0x0
.equ	POWMAN_EXT_TIME_REF_DRIVE_LPCK_BITS, 0x00000010
.equ	POWMAN_EXT_TIME_REF_DRIVE_LPCK_MSB, 4
.equ	POWMAN_EXT_TIME_REF_DRIVE_LPCK_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_EXT_TIME_REF_SOURCE_SEL
# Description : 0 ->  gpio12
#               1 ->  gpio20
#               2 ->  gpio14
#               3 ->  gpio22
.equ	POWMAN_EXT_TIME_REF_SOURCE_SEL_RESET, 0x0
.equ	POWMAN_EXT_TIME_REF_SOURCE_SEL_BITS, 0x00000003
.equ	POWMAN_EXT_TIME_REF_SOURCE_SEL_MSB, 1
.equ	POWMAN_EXT_TIME_REF_SOURCE_SEL_LSB, 0
# =============================================================================
# Register    : POWMAN_LPOSC_FREQ_KHZ_INT
# Description : Informs the AON Timer of the integer component of the clock
#               frequency when running off the LPOSC.
#               Integer component of the LPOSC or GPIO clock source frequency
#               in kHz. Default = 32 This field must only be written when
#               POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=1
.equ	POWMAN_LPOSC_FREQ_KHZ_INT_OFFSET, 0x00000050
.equ	POWMAN_LPOSC_FREQ_KHZ_INT_BITS, 0x0000003f
.equ	POWMAN_LPOSC_FREQ_KHZ_INT_RESET, 0x00000020
.equ	POWMAN_LPOSC_FREQ_KHZ_INT_MSB, 5
.equ	POWMAN_LPOSC_FREQ_KHZ_INT_LSB, 0
# =============================================================================
# Register    : POWMAN_LPOSC_FREQ_KHZ_FRAC
# Description : Informs the AON Timer of the fractional component of the clock
#               frequency when running off the LPOSC.
#               Fractional component of the LPOSC or GPIO clock source
#               frequency in kHz. Default = 0.768 This field must only be
#               written when POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=1
.equ	POWMAN_LPOSC_FREQ_KHZ_FRAC_OFFSET, 0x00000054
.equ	POWMAN_LPOSC_FREQ_KHZ_FRAC_BITS, 0x0000ffff
.equ	POWMAN_LPOSC_FREQ_KHZ_FRAC_RESET, 0x0000c49c
.equ	POWMAN_LPOSC_FREQ_KHZ_FRAC_MSB, 15
.equ	POWMAN_LPOSC_FREQ_KHZ_FRAC_LSB, 0
# =============================================================================
# Register    : POWMAN_XOSC_FREQ_KHZ_INT
# Description : Informs the AON Timer of the integer component of the clock
#               frequency when running off the XOSC.
#               Integer component of the XOSC frequency in kHz. Default = 12000
#               Must be >1 This field must only be written when
#               POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=0
.equ	POWMAN_XOSC_FREQ_KHZ_INT_OFFSET, 0x00000058
.equ	POWMAN_XOSC_FREQ_KHZ_INT_BITS, 0x0000ffff
.equ	POWMAN_XOSC_FREQ_KHZ_INT_RESET, 0x00002ee0
.equ	POWMAN_XOSC_FREQ_KHZ_INT_MSB, 15
.equ	POWMAN_XOSC_FREQ_KHZ_INT_LSB, 0
# =============================================================================
# Register    : POWMAN_XOSC_FREQ_KHZ_FRAC
# Description : Informs the AON Timer of the fractional component of the clock
#               frequency when running off the XOSC.
#               Fractional component of the XOSC frequency in kHz. This field
#               must only be written when POWMAN_TIMER_RUN=0 or
#               POWMAN_TIMER_USING_XOSC=0
.equ	POWMAN_XOSC_FREQ_KHZ_FRAC_OFFSET, 0x0000005c
.equ	POWMAN_XOSC_FREQ_KHZ_FRAC_BITS, 0x0000ffff
.equ	POWMAN_XOSC_FREQ_KHZ_FRAC_RESET, 0x00000000
.equ	POWMAN_XOSC_FREQ_KHZ_FRAC_MSB, 15
.equ	POWMAN_XOSC_FREQ_KHZ_FRAC_LSB, 0
# =============================================================================
# Register    : POWMAN_SET_TIME_63TO48
# Description : None
#               For setting the time, do not use for reading the time, use
#               POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field
#               must only be written when POWMAN_TIMER_RUN=0
.equ	POWMAN_SET_TIME_63TO48_OFFSET, 0x00000060
.equ	POWMAN_SET_TIME_63TO48_BITS, 0x0000ffff
.equ	POWMAN_SET_TIME_63TO48_RESET, 0x00000000
.equ	POWMAN_SET_TIME_63TO48_MSB, 15
.equ	POWMAN_SET_TIME_63TO48_LSB, 0
# =============================================================================
# Register    : POWMAN_SET_TIME_47TO32
# Description : None
#               For setting the time, do not use for reading the time, use
#               POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field
#               must only be written when POWMAN_TIMER_RUN=0
.equ	POWMAN_SET_TIME_47TO32_OFFSET, 0x00000064
.equ	POWMAN_SET_TIME_47TO32_BITS, 0x0000ffff
.equ	POWMAN_SET_TIME_47TO32_RESET, 0x00000000
.equ	POWMAN_SET_TIME_47TO32_MSB, 15
.equ	POWMAN_SET_TIME_47TO32_LSB, 0
# =============================================================================
# Register    : POWMAN_SET_TIME_31TO16
# Description : None
#               For setting the time, do not use for reading the time, use
#               POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field
#               must only be written when POWMAN_TIMER_RUN=0
.equ	POWMAN_SET_TIME_31TO16_OFFSET, 0x00000068
.equ	POWMAN_SET_TIME_31TO16_BITS, 0x0000ffff
.equ	POWMAN_SET_TIME_31TO16_RESET, 0x00000000
.equ	POWMAN_SET_TIME_31TO16_MSB, 15
.equ	POWMAN_SET_TIME_31TO16_LSB, 0
# =============================================================================
# Register    : POWMAN_SET_TIME_15TO0
# Description : None
#               For setting the time, do not use for reading the time, use
#               POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field
#               must only be written when POWMAN_TIMER_RUN=0
.equ	POWMAN_SET_TIME_15TO0_OFFSET, 0x0000006c
.equ	POWMAN_SET_TIME_15TO0_BITS, 0x0000ffff
.equ	POWMAN_SET_TIME_15TO0_RESET, 0x00000000
.equ	POWMAN_SET_TIME_15TO0_MSB, 15
.equ	POWMAN_SET_TIME_15TO0_LSB, 0
# =============================================================================
# Register    : POWMAN_READ_TIME_UPPER
# Description : None
#               For reading bits 63:32 of the timer. When reading all 64 bits
#               it is possible for the LOWER count to rollover during the read.
#               It is recommended to read UPPER, then LOWER, then re-read UPPER
#               and, if it has changed, re-read LOWER.
.equ	POWMAN_READ_TIME_UPPER_OFFSET, 0x00000070
.equ	POWMAN_READ_TIME_UPPER_BITS, 0xffffffff
.equ	POWMAN_READ_TIME_UPPER_RESET, 0x00000000
.equ	POWMAN_READ_TIME_UPPER_MSB, 31
.equ	POWMAN_READ_TIME_UPPER_LSB, 0
# =============================================================================
# Register    : POWMAN_READ_TIME_LOWER
# Description : None
#               For reading bits 31:0 of the timer.
.equ	POWMAN_READ_TIME_LOWER_OFFSET, 0x00000074
.equ	POWMAN_READ_TIME_LOWER_BITS, 0xffffffff
.equ	POWMAN_READ_TIME_LOWER_RESET, 0x00000000
.equ	POWMAN_READ_TIME_LOWER_MSB, 31
.equ	POWMAN_READ_TIME_LOWER_LSB, 0
# =============================================================================
# Register    : POWMAN_ALARM_TIME_63TO48
# Description : None
#               This field must only be written when POWMAN_ALARM_ENAB=0
.equ	POWMAN_ALARM_TIME_63TO48_OFFSET, 0x00000078
.equ	POWMAN_ALARM_TIME_63TO48_BITS, 0x0000ffff
.equ	POWMAN_ALARM_TIME_63TO48_RESET, 0x00000000
.equ	POWMAN_ALARM_TIME_63TO48_MSB, 15
.equ	POWMAN_ALARM_TIME_63TO48_LSB, 0
# =============================================================================
# Register    : POWMAN_ALARM_TIME_47TO32
# Description : None
#               This field must only be written when POWMAN_ALARM_ENAB=0
.equ	POWMAN_ALARM_TIME_47TO32_OFFSET, 0x0000007c
.equ	POWMAN_ALARM_TIME_47TO32_BITS, 0x0000ffff
.equ	POWMAN_ALARM_TIME_47TO32_RESET, 0x00000000
.equ	POWMAN_ALARM_TIME_47TO32_MSB, 15
.equ	POWMAN_ALARM_TIME_47TO32_LSB, 0
# =============================================================================
# Register    : POWMAN_ALARM_TIME_31TO16
# Description : None
#               This field must only be written when POWMAN_ALARM_ENAB=0
.equ	POWMAN_ALARM_TIME_31TO16_OFFSET, 0x00000080
.equ	POWMAN_ALARM_TIME_31TO16_BITS, 0x0000ffff
.equ	POWMAN_ALARM_TIME_31TO16_RESET, 0x00000000
.equ	POWMAN_ALARM_TIME_31TO16_MSB, 15
.equ	POWMAN_ALARM_TIME_31TO16_LSB, 0
# =============================================================================
# Register    : POWMAN_ALARM_TIME_15TO0
# Description : None
#               This field must only be written when POWMAN_ALARM_ENAB=0
.equ	POWMAN_ALARM_TIME_15TO0_OFFSET, 0x00000084
.equ	POWMAN_ALARM_TIME_15TO0_BITS, 0x0000ffff
.equ	POWMAN_ALARM_TIME_15TO0_RESET, 0x00000000
.equ	POWMAN_ALARM_TIME_15TO0_MSB, 15
.equ	POWMAN_ALARM_TIME_15TO0_LSB, 0
# =============================================================================
# Register    : POWMAN_TIMER
.equ	POWMAN_TIMER_OFFSET, 0x00000088
.equ	POWMAN_TIMER_BITS, 0x000f2777
.equ	POWMAN_TIMER_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_USING_GPIO_1HZ
# Description : Timer is synchronised to a 1hz gpio source
.equ	POWMAN_TIMER_USING_GPIO_1HZ_RESET, 0x0
.equ	POWMAN_TIMER_USING_GPIO_1HZ_BITS, 0x00080000
.equ	POWMAN_TIMER_USING_GPIO_1HZ_MSB, 19
.equ	POWMAN_TIMER_USING_GPIO_1HZ_LSB, 19
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_USING_GPIO_1KHZ
# Description : Timer is running from a 1khz gpio source
.equ	POWMAN_TIMER_USING_GPIO_1KHZ_RESET, 0x0
.equ	POWMAN_TIMER_USING_GPIO_1KHZ_BITS, 0x00040000
.equ	POWMAN_TIMER_USING_GPIO_1KHZ_MSB, 18
.equ	POWMAN_TIMER_USING_GPIO_1KHZ_LSB, 18
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_USING_LPOSC
# Description : Timer is running from lposc
.equ	POWMAN_TIMER_USING_LPOSC_RESET, 0x0
.equ	POWMAN_TIMER_USING_LPOSC_BITS, 0x00020000
.equ	POWMAN_TIMER_USING_LPOSC_MSB, 17
.equ	POWMAN_TIMER_USING_LPOSC_LSB, 17
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_USING_XOSC
# Description : Timer is running from xosc
.equ	POWMAN_TIMER_USING_XOSC_RESET, 0x0
.equ	POWMAN_TIMER_USING_XOSC_BITS, 0x00010000
.equ	POWMAN_TIMER_USING_XOSC_MSB, 16
.equ	POWMAN_TIMER_USING_XOSC_LSB, 16
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_USE_GPIO_1HZ
# Description : Selects the gpio source as the reference for the sec counter.
#               The msec counter will continue to use the lposc or xosc
#               reference.
.equ	POWMAN_TIMER_USE_GPIO_1HZ_RESET, 0x0
.equ	POWMAN_TIMER_USE_GPIO_1HZ_BITS, 0x00002000
.equ	POWMAN_TIMER_USE_GPIO_1HZ_MSB, 13
.equ	POWMAN_TIMER_USE_GPIO_1HZ_LSB, 13
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_USE_GPIO_1KHZ
# Description : switch to gpio as the source of the 1kHz timer tick
.equ	POWMAN_TIMER_USE_GPIO_1KHZ_RESET, 0x0
.equ	POWMAN_TIMER_USE_GPIO_1KHZ_BITS, 0x00000400
.equ	POWMAN_TIMER_USE_GPIO_1KHZ_MSB, 10
.equ	POWMAN_TIMER_USE_GPIO_1KHZ_LSB, 10
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_USE_XOSC
# Description : switch to xosc as the source of the 1kHz timer tick
.equ	POWMAN_TIMER_USE_XOSC_RESET, 0x0
.equ	POWMAN_TIMER_USE_XOSC_BITS, 0x00000200
.equ	POWMAN_TIMER_USE_XOSC_MSB, 9
.equ	POWMAN_TIMER_USE_XOSC_LSB, 9
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_USE_LPOSC
# Description : Switch to lposc as the source of the 1kHz timer tick
.equ	POWMAN_TIMER_USE_LPOSC_RESET, 0x0
.equ	POWMAN_TIMER_USE_LPOSC_BITS, 0x00000100
.equ	POWMAN_TIMER_USE_LPOSC_MSB, 8
.equ	POWMAN_TIMER_USE_LPOSC_LSB, 8
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_ALARM
# Description : Alarm has fired. Write to 1 to clear the alarm.
.equ	POWMAN_TIMER_ALARM_RESET, 0x0
.equ	POWMAN_TIMER_ALARM_BITS, 0x00000040
.equ	POWMAN_TIMER_ALARM_MSB, 6
.equ	POWMAN_TIMER_ALARM_LSB, 6
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_PWRUP_ON_ALARM
# Description : Alarm wakes the chip from low power mode
.equ	POWMAN_TIMER_PWRUP_ON_ALARM_RESET, 0x0
.equ	POWMAN_TIMER_PWRUP_ON_ALARM_BITS, 0x00000020
.equ	POWMAN_TIMER_PWRUP_ON_ALARM_MSB, 5
.equ	POWMAN_TIMER_PWRUP_ON_ALARM_LSB, 5
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_ALARM_ENAB
# Description : Enables the alarm. The alarm must be disabled while writing the
#               alarm time.
.equ	POWMAN_TIMER_ALARM_ENAB_RESET, 0x0
.equ	POWMAN_TIMER_ALARM_ENAB_BITS, 0x00000010
.equ	POWMAN_TIMER_ALARM_ENAB_MSB, 4
.equ	POWMAN_TIMER_ALARM_ENAB_LSB, 4
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_CLEAR
# Description : Clears the timer, does not disable the timer and does not
#               affect the alarm. This control can be written at any time.
.equ	POWMAN_TIMER_CLEAR_RESET, 0x0
.equ	POWMAN_TIMER_CLEAR_BITS, 0x00000004
.equ	POWMAN_TIMER_CLEAR_MSB, 2
.equ	POWMAN_TIMER_CLEAR_LSB, 2
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_RUN
# Description : Timer enable. Setting this bit causes the timer to begin
#               counting up from its current value. Clearing this bit stops the
#               timer from counting.
#
#               Before enabling the timer, set the POWMAN_LPOSC_FREQ* and
#               POWMAN_XOSC_FREQ* registers to configure the count rate, and
#               initialise the current time by writing to SET_TIME_63TO48
#               through SET_TIME_15TO0. You must not write to the SET_TIME_x
#               registers when the timer is running.
#
#               Once configured, start the timer by setting POWMAN_TIMER_RUN=1.
#               This will start the timer running from the LPOSC. When the XOSC
#               is available switch the reference clock to XOSC then select it
#               as the timer clock by setting POWMAN_TIMER_USE_XOSC=1
.equ	POWMAN_TIMER_RUN_RESET, 0x0
.equ	POWMAN_TIMER_RUN_BITS, 0x00000002
.equ	POWMAN_TIMER_RUN_MSB, 1
.equ	POWMAN_TIMER_RUN_LSB, 1
# -----------------------------------------------------------------------------
# Field       : POWMAN_TIMER_NONSEC_WRITE
# Description : Control whether Non-secure software can write to the timer
#               registers. All other registers are hardwired to be inaccessible
#               to Non-secure.
.equ	POWMAN_TIMER_NONSEC_WRITE_RESET, 0x0
.equ	POWMAN_TIMER_NONSEC_WRITE_BITS, 0x00000001
.equ	POWMAN_TIMER_NONSEC_WRITE_MSB, 0
.equ	POWMAN_TIMER_NONSEC_WRITE_LSB, 0
# =============================================================================
# Register    : POWMAN_PWRUP0
# Description : 4 GPIO powerup events can be configured to wake the chip up
#               from a low power state.
#               The pwrups are level/edge sensitive and can be set to trigger
#               on a high/rising or low/falling event
#               The number of gpios available depends on the package option. An
#               invalid selection will be ignored
#               source = 0 selects gpio0
#               .
#               .
#               source = 47 selects gpio47
#               source = 48 selects qspi_ss
#               source = 49 selects qspi_sd0
#               source = 50 selects qspi_sd1
#               source = 51 selects qspi_sd2
#               source = 52 selects qspi_sd3
#               source = 53 selects qspi_sclk
#               level  = 0 triggers the pwrup when the source is low
#               level  = 1 triggers the pwrup when the source is high
.equ	POWMAN_PWRUP0_OFFSET, 0x0000008c
.equ	POWMAN_PWRUP0_BITS, 0x000007ff
.equ	POWMAN_PWRUP0_RESET, 0x0000003f
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP0_RAW_STATUS
# Description : Value of selected gpio pin (only if enable == 1)
.equ	POWMAN_PWRUP0_RAW_STATUS_RESET, 0x0
.equ	POWMAN_PWRUP0_RAW_STATUS_BITS, 0x00000400
.equ	POWMAN_PWRUP0_RAW_STATUS_MSB, 10
.equ	POWMAN_PWRUP0_RAW_STATUS_LSB, 10
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP0_STATUS
# Description : Status of gpio wakeup. Write to 1 to clear a latched edge
#               detect.
.equ	POWMAN_PWRUP0_STATUS_RESET, 0x0
.equ	POWMAN_PWRUP0_STATUS_BITS, 0x00000200
.equ	POWMAN_PWRUP0_STATUS_MSB, 9
.equ	POWMAN_PWRUP0_STATUS_LSB, 9
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP0_MODE
# Description : Edge or level detect. Edge will detect a 0 to 1 transition (or
#               1 to 0 transition). Level will detect a 1 or 0. Both types of
#               event get latched into the current_pwrup_req register.
#               0x0 -> level
#               0x1 -> edge
.equ	POWMAN_PWRUP0_MODE_RESET, 0x0
.equ	POWMAN_PWRUP0_MODE_BITS, 0x00000100
.equ	POWMAN_PWRUP0_MODE_MSB, 8
.equ	POWMAN_PWRUP0_MODE_LSB, 8
.equ	POWMAN_PWRUP0_MODE_VALUE_LEVEL, 0x0
.equ	POWMAN_PWRUP0_MODE_VALUE_EDGE, 0x1
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP0_DIRECTION
#               0x0 -> low_falling
#               0x1 -> high_rising
.equ	POWMAN_PWRUP0_DIRECTION_RESET, 0x0
.equ	POWMAN_PWRUP0_DIRECTION_BITS, 0x00000080
.equ	POWMAN_PWRUP0_DIRECTION_MSB, 7
.equ	POWMAN_PWRUP0_DIRECTION_LSB, 7
.equ	POWMAN_PWRUP0_DIRECTION_VALUE_LOW_FALLING, 0x0
.equ	POWMAN_PWRUP0_DIRECTION_VALUE_HIGH_RISING, 0x1
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP0_ENABLE
# Description : Set to 1 to enable the wakeup source. Set to 0 to disable the
#               wakeup source and clear a pending wakeup event.
#               If using edge detect a latched edge needs to be cleared by
#               writing 1 to the status register also.
.equ	POWMAN_PWRUP0_ENABLE_RESET, 0x0
.equ	POWMAN_PWRUP0_ENABLE_BITS, 0x00000040
.equ	POWMAN_PWRUP0_ENABLE_MSB, 6
.equ	POWMAN_PWRUP0_ENABLE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP0_SOURCE
.equ	POWMAN_PWRUP0_SOURCE_RESET, 0x3f
.equ	POWMAN_PWRUP0_SOURCE_BITS, 0x0000003f
.equ	POWMAN_PWRUP0_SOURCE_MSB, 5
.equ	POWMAN_PWRUP0_SOURCE_LSB, 0
# =============================================================================
# Register    : POWMAN_PWRUP1
# Description : 4 GPIO powerup events can be configured to wake the chip up
#               from a low power state.
#               The pwrups are level/edge sensitive and can be set to trigger
#               on a high/rising or low/falling event
#               The number of gpios available depends on the package option. An
#               invalid selection will be ignored
#               source = 0 selects gpio0
#               .
#               .
#               source = 47 selects gpio47
#               source = 48 selects qspi_ss
#               source = 49 selects qspi_sd0
#               source = 50 selects qspi_sd1
#               source = 51 selects qspi_sd2
#               source = 52 selects qspi_sd3
#               source = 53 selects qspi_sclk
#               level  = 0 triggers the pwrup when the source is low
#               level  = 1 triggers the pwrup when the source is high
.equ	POWMAN_PWRUP1_OFFSET, 0x00000090
.equ	POWMAN_PWRUP1_BITS, 0x000007ff
.equ	POWMAN_PWRUP1_RESET, 0x0000003f
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP1_RAW_STATUS
# Description : Value of selected gpio pin (only if enable == 1)
.equ	POWMAN_PWRUP1_RAW_STATUS_RESET, 0x0
.equ	POWMAN_PWRUP1_RAW_STATUS_BITS, 0x00000400
.equ	POWMAN_PWRUP1_RAW_STATUS_MSB, 10
.equ	POWMAN_PWRUP1_RAW_STATUS_LSB, 10
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP1_STATUS
# Description : Status of gpio wakeup. Write to 1 to clear a latched edge
#               detect.
.equ	POWMAN_PWRUP1_STATUS_RESET, 0x0
.equ	POWMAN_PWRUP1_STATUS_BITS, 0x00000200
.equ	POWMAN_PWRUP1_STATUS_MSB, 9
.equ	POWMAN_PWRUP1_STATUS_LSB, 9
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP1_MODE
# Description : Edge or level detect. Edge will detect a 0 to 1 transition (or
#               1 to 0 transition). Level will detect a 1 or 0. Both types of
#               event get latched into the current_pwrup_req register.
#               0x0 -> level
#               0x1 -> edge
.equ	POWMAN_PWRUP1_MODE_RESET, 0x0
.equ	POWMAN_PWRUP1_MODE_BITS, 0x00000100
.equ	POWMAN_PWRUP1_MODE_MSB, 8
.equ	POWMAN_PWRUP1_MODE_LSB, 8
.equ	POWMAN_PWRUP1_MODE_VALUE_LEVEL, 0x0
