konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/powman.inc
.equ	POWMAN_PWRUP1_MODE_VALUE_EDGE, 0x1
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP1_DIRECTION
#               0x0 -> low_falling
#               0x1 -> high_rising
.equ	POWMAN_PWRUP1_DIRECTION_RESET, 0x0
.equ	POWMAN_PWRUP1_DIRECTION_BITS, 0x00000080
.equ	POWMAN_PWRUP1_DIRECTION_MSB, 7
.equ	POWMAN_PWRUP1_DIRECTION_LSB, 7
.equ	POWMAN_PWRUP1_DIRECTION_VALUE_LOW_FALLING, 0x0
.equ	POWMAN_PWRUP1_DIRECTION_VALUE_HIGH_RISING, 0x1
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP1_ENABLE
# Description : Set to 1 to enable the wakeup source. Set to 0 to disable the
#               wakeup source and clear a pending wakeup event.
#               If using edge detect a latched edge needs to be cleared by
#               writing 1 to the status register also.
.equ	POWMAN_PWRUP1_ENABLE_RESET, 0x0
.equ	POWMAN_PWRUP1_ENABLE_BITS, 0x00000040
.equ	POWMAN_PWRUP1_ENABLE_MSB, 6
.equ	POWMAN_PWRUP1_ENABLE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP1_SOURCE
.equ	POWMAN_PWRUP1_SOURCE_RESET, 0x3f
.equ	POWMAN_PWRUP1_SOURCE_BITS, 0x0000003f
.equ	POWMAN_PWRUP1_SOURCE_MSB, 5
.equ	POWMAN_PWRUP1_SOURCE_LSB, 0
# =============================================================================
# Register    : POWMAN_PWRUP2
# Description : 4 GPIO powerup events can be configured to wake the chip up
#               from a low power state.
#               The pwrups are level/edge sensitive and can be set to trigger
#               on a high/rising or low/falling event
#               The number of gpios available depends on the package option. An
#               invalid selection will be ignored
#               source = 0 selects gpio0
#               .
#               .
#               source = 47 selects gpio47
#               source = 48 selects qspi_ss
#               source = 49 selects qspi_sd0
#               source = 50 selects qspi_sd1
#               source = 51 selects qspi_sd2
#               source = 52 selects qspi_sd3
#               source = 53 selects qspi_sclk
#               level  = 0 triggers the pwrup when the source is low
#               level  = 1 triggers the pwrup when the source is high
.equ	POWMAN_PWRUP2_OFFSET, 0x00000094
.equ	POWMAN_PWRUP2_BITS, 0x000007ff
.equ	POWMAN_PWRUP2_RESET, 0x0000003f
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP2_RAW_STATUS
# Description : Value of selected gpio pin (only if enable == 1)
.equ	POWMAN_PWRUP2_RAW_STATUS_RESET, 0x0
.equ	POWMAN_PWRUP2_RAW_STATUS_BITS, 0x00000400
.equ	POWMAN_PWRUP2_RAW_STATUS_MSB, 10
.equ	POWMAN_PWRUP2_RAW_STATUS_LSB, 10
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP2_STATUS
# Description : Status of gpio wakeup. Write to 1 to clear a latched edge
#               detect.
.equ	POWMAN_PWRUP2_STATUS_RESET, 0x0
.equ	POWMAN_PWRUP2_STATUS_BITS, 0x00000200
.equ	POWMAN_PWRUP2_STATUS_MSB, 9
.equ	POWMAN_PWRUP2_STATUS_LSB, 9
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP2_MODE
# Description : Edge or level detect. Edge will detect a 0 to 1 transition (or
#               1 to 0 transition). Level will detect a 1 or 0. Both types of
#               event get latched into the current_pwrup_req register.
#               0x0 -> level
#               0x1 -> edge
.equ	POWMAN_PWRUP2_MODE_RESET, 0x0
.equ	POWMAN_PWRUP2_MODE_BITS, 0x00000100
.equ	POWMAN_PWRUP2_MODE_MSB, 8
.equ	POWMAN_PWRUP2_MODE_LSB, 8
.equ	POWMAN_PWRUP2_MODE_VALUE_LEVEL, 0x0
.equ	POWMAN_PWRUP2_MODE_VALUE_EDGE, 0x1
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP2_DIRECTION
#               0x0 -> low_falling
#               0x1 -> high_rising
.equ	POWMAN_PWRUP2_DIRECTION_RESET, 0x0
.equ	POWMAN_PWRUP2_DIRECTION_BITS, 0x00000080
.equ	POWMAN_PWRUP2_DIRECTION_MSB, 7
.equ	POWMAN_PWRUP2_DIRECTION_LSB, 7
.equ	POWMAN_PWRUP2_DIRECTION_VALUE_LOW_FALLING, 0x0
.equ	POWMAN_PWRUP2_DIRECTION_VALUE_HIGH_RISING, 0x1
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP2_ENABLE
# Description : Set to 1 to enable the wakeup source. Set to 0 to disable the
#               wakeup source and clear a pending wakeup event.
#               If using edge detect a latched edge needs to be cleared by
#               writing 1 to the status register also.
.equ	POWMAN_PWRUP2_ENABLE_RESET, 0x0
.equ	POWMAN_PWRUP2_ENABLE_BITS, 0x00000040
.equ	POWMAN_PWRUP2_ENABLE_MSB, 6
.equ	POWMAN_PWRUP2_ENABLE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP2_SOURCE
.equ	POWMAN_PWRUP2_SOURCE_RESET, 0x3f
.equ	POWMAN_PWRUP2_SOURCE_BITS, 0x0000003f
.equ	POWMAN_PWRUP2_SOURCE_MSB, 5
.equ	POWMAN_PWRUP2_SOURCE_LSB, 0
# =============================================================================
# Register    : POWMAN_PWRUP3
# Description : 4 GPIO powerup events can be configured to wake the chip up
#               from a low power state.
#               The pwrups are level/edge sensitive and can be set to trigger
#               on a high/rising or low/falling event
#               The number of gpios available depends on the package option. An
#               invalid selection will be ignored
#               source = 0 selects gpio0
#               .
#               .
#               source = 47 selects gpio47
#               source = 48 selects qspi_ss
#               source = 49 selects qspi_sd0
#               source = 50 selects qspi_sd1
#               source = 51 selects qspi_sd2
#               source = 52 selects qspi_sd3
#               source = 53 selects qspi_sclk
#               level  = 0 triggers the pwrup when the source is low
#               level  = 1 triggers the pwrup when the source is high
.equ	POWMAN_PWRUP3_OFFSET, 0x00000098
.equ	POWMAN_PWRUP3_BITS, 0x000007ff
.equ	POWMAN_PWRUP3_RESET, 0x0000003f
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP3_RAW_STATUS
# Description : Value of selected gpio pin (only if enable == 1)
.equ	POWMAN_PWRUP3_RAW_STATUS_RESET, 0x0
.equ	POWMAN_PWRUP3_RAW_STATUS_BITS, 0x00000400
.equ	POWMAN_PWRUP3_RAW_STATUS_MSB, 10
.equ	POWMAN_PWRUP3_RAW_STATUS_LSB, 10
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP3_STATUS
# Description : Status of gpio wakeup. Write to 1 to clear a latched edge
#               detect.
.equ	POWMAN_PWRUP3_STATUS_RESET, 0x0
.equ	POWMAN_PWRUP3_STATUS_BITS, 0x00000200
.equ	POWMAN_PWRUP3_STATUS_MSB, 9
.equ	POWMAN_PWRUP3_STATUS_LSB, 9
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP3_MODE
# Description : Edge or level detect. Edge will detect a 0 to 1 transition (or
#               1 to 0 transition). Level will detect a 1 or 0. Both types of
#               event get latched into the current_pwrup_req register.
#               0x0 -> level
#               0x1 -> edge
.equ	POWMAN_PWRUP3_MODE_RESET, 0x0
.equ	POWMAN_PWRUP3_MODE_BITS, 0x00000100
.equ	POWMAN_PWRUP3_MODE_MSB, 8
.equ	POWMAN_PWRUP3_MODE_LSB, 8
.equ	POWMAN_PWRUP3_MODE_VALUE_LEVEL, 0x0
.equ	POWMAN_PWRUP3_MODE_VALUE_EDGE, 0x1
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP3_DIRECTION
#               0x0 -> low_falling
#               0x1 -> high_rising
.equ	POWMAN_PWRUP3_DIRECTION_RESET, 0x0
.equ	POWMAN_PWRUP3_DIRECTION_BITS, 0x00000080
.equ	POWMAN_PWRUP3_DIRECTION_MSB, 7
.equ	POWMAN_PWRUP3_DIRECTION_LSB, 7
.equ	POWMAN_PWRUP3_DIRECTION_VALUE_LOW_FALLING, 0x0
.equ	POWMAN_PWRUP3_DIRECTION_VALUE_HIGH_RISING, 0x1
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP3_ENABLE
# Description : Set to 1 to enable the wakeup source. Set to 0 to disable the
#               wakeup source and clear a pending wakeup event.
#               If using edge detect a latched edge needs to be cleared by
#               writing 1 to the status register also.
.equ	POWMAN_PWRUP3_ENABLE_RESET, 0x0
.equ	POWMAN_PWRUP3_ENABLE_BITS, 0x00000040
.equ	POWMAN_PWRUP3_ENABLE_MSB, 6
.equ	POWMAN_PWRUP3_ENABLE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : POWMAN_PWRUP3_SOURCE
.equ	POWMAN_PWRUP3_SOURCE_RESET, 0x3f
.equ	POWMAN_PWRUP3_SOURCE_BITS, 0x0000003f
.equ	POWMAN_PWRUP3_SOURCE_MSB, 5
.equ	POWMAN_PWRUP3_SOURCE_LSB, 0
# =============================================================================
# Register    : POWMAN_CURRENT_PWRUP_REQ
# Description : Indicates current powerup request state
#               pwrup events can be cleared by removing the enable from the
#               pwrup register. The alarm pwrup req can be cleared by clearing
#               timer.alarm_enab
#               0 = chip reset, for the source of the last reset see
#               POWMAN_CHIP_RESET
#               1 = pwrup0
#               2 = pwrup1
#               3 = pwrup2
#               4 = pwrup3
#               5 = coresight_pwrup
#               6 = alarm_pwrup
.equ	POWMAN_CURRENT_PWRUP_REQ_OFFSET, 0x0000009c
.equ	POWMAN_CURRENT_PWRUP_REQ_BITS, 0x0000007f
.equ	POWMAN_CURRENT_PWRUP_REQ_RESET, 0x00000000
.equ	POWMAN_CURRENT_PWRUP_REQ_MSB, 6
.equ	POWMAN_CURRENT_PWRUP_REQ_LSB, 0
# =============================================================================
# Register    : POWMAN_LAST_SWCORE_PWRUP
# Description : Indicates which pwrup source triggered the last switched-core
#               power up
#               0 = chip reset, for the source of the last reset see
#               POWMAN_CHIP_RESET
#               1 = pwrup0
#               2 = pwrup1
#               3 = pwrup2
#               4 = pwrup3
#               5 = coresight_pwrup
#               6 = alarm_pwrup
.equ	POWMAN_LAST_SWCORE_PWRUP_OFFSET, 0x000000a0
.equ	POWMAN_LAST_SWCORE_PWRUP_BITS, 0x0000007f
.equ	POWMAN_LAST_SWCORE_PWRUP_RESET, 0x00000000
.equ	POWMAN_LAST_SWCORE_PWRUP_MSB, 6
.equ	POWMAN_LAST_SWCORE_PWRUP_LSB, 0
# =============================================================================
# Register    : POWMAN_DBG_PWRCFG
.equ	POWMAN_DBG_PWRCFG_OFFSET, 0x000000a4
.equ	POWMAN_DBG_PWRCFG_BITS, 0x00000001
.equ	POWMAN_DBG_PWRCFG_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : POWMAN_DBG_PWRCFG_IGNORE
# Description : Ignore pwrup req from debugger. If pwrup req is asserted then
#               this will prevent power down and set powerdown blocked. Set
#               ignore to stop paying attention to pwrup_req
.equ	POWMAN_DBG_PWRCFG_IGNORE_RESET, 0x0
.equ	POWMAN_DBG_PWRCFG_IGNORE_BITS, 0x00000001
.equ	POWMAN_DBG_PWRCFG_IGNORE_MSB, 0
.equ	POWMAN_DBG_PWRCFG_IGNORE_LSB, 0
# =============================================================================
# Register    : POWMAN_BOOTDIS
# Description : Tell the bootrom to ignore the BOOT0..3 registers following the
#               next RSM reset (e.g. the next core power down/up).
#
#               If an early boot stage has soft-locked some OTP pages in order
#               to protect their contents from later stages, there is a risk
#               that Secure code running at a later stage can unlock the pages
#               by powering the core up and down.
#
#               This register can be used to ensure that the bootloader runs as
#               normal on the next power up, preventing Secure code at a later
#               stage from accessing OTP in its unlocked state.
#
#               Should be used in conjunction with the OTP BOOTDIS register.
.equ	POWMAN_BOOTDIS_OFFSET, 0x000000a8
.equ	POWMAN_BOOTDIS_BITS, 0x00000003
.equ	POWMAN_BOOTDIS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : POWMAN_BOOTDIS_NEXT
# Description : This flag always ORs writes into its current contents. It can
#               be set but not cleared by software.
#
#               The BOOTDIS_NEXT bit is OR'd into the BOOTDIS_NOW bit when the
#               core is powered down. Simultaneously, the BOOTDIS_NEXT bit is
#               cleared. Setting this bit means that the BOOT0..3 registers
#               will be ignored following the next reset of the RSM by powman.
#
#               This flag should be set by an early boot stage that has soft-
#               locked OTP pages, to prevent later stages from unlocking it by
#               power cycling.
.equ	POWMAN_BOOTDIS_NEXT_RESET, 0x0
.equ	POWMAN_BOOTDIS_NEXT_BITS, 0x00000002
.equ	POWMAN_BOOTDIS_NEXT_MSB, 1
.equ	POWMAN_BOOTDIS_NEXT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : POWMAN_BOOTDIS_NOW
# Description : When powman resets the RSM, the current value of BOOTDIS_NEXT
#               is OR'd into BOOTDIS_NOW, and BOOTDIS_NEXT is cleared.
#
#               The bootrom checks this flag before reading the BOOT0..3
#               registers. If it is set, the bootrom clears it, and ignores the
#               BOOT registers. This prevents Secure software from diverting
#               the boot path before a bootloader has had the chance to soft
#               lock OTP pages containing sensitive data.
.equ	POWMAN_BOOTDIS_NOW_RESET, 0x0
.equ	POWMAN_BOOTDIS_NOW_BITS, 0x00000001
.equ	POWMAN_BOOTDIS_NOW_MSB, 0
.equ	POWMAN_BOOTDIS_NOW_LSB, 0
# =============================================================================
# Register    : POWMAN_DBGCONFIG
.equ	POWMAN_DBGCONFIG_OFFSET, 0x000000ac
.equ	POWMAN_DBGCONFIG_BITS, 0x0000000f
.equ	POWMAN_DBGCONFIG_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : POWMAN_DBGCONFIG_DP_INSTID
# Description : Configure DP instance ID for SWD multidrop selection.
#               Recommend that this is NOT changed until you require debug
#               access in multi-chip environment
.equ	POWMAN_DBGCONFIG_DP_INSTID_RESET, 0x0
.equ	POWMAN_DBGCONFIG_DP_INSTID_BITS, 0x0000000f
.equ	POWMAN_DBGCONFIG_DP_INSTID_MSB, 3
.equ	POWMAN_DBGCONFIG_DP_INSTID_LSB, 0
# =============================================================================
# Register    : POWMAN_SCRATCH0
# Description : Scratch register. Information persists in low power mode
.equ	POWMAN_SCRATCH0_OFFSET, 0x000000b0
.equ	POWMAN_SCRATCH0_BITS, 0xffffffff
.equ	POWMAN_SCRATCH0_RESET, 0x00000000
.equ	POWMAN_SCRATCH0_MSB, 31
.equ	POWMAN_SCRATCH0_LSB, 0
# =============================================================================
# Register    : POWMAN_SCRATCH1
# Description : Scratch register. Information persists in low power mode
.equ	POWMAN_SCRATCH1_OFFSET, 0x000000b4
.equ	POWMAN_SCRATCH1_BITS, 0xffffffff
.equ	POWMAN_SCRATCH1_RESET, 0x00000000
.equ	POWMAN_SCRATCH1_MSB, 31
.equ	POWMAN_SCRATCH1_LSB, 0
# =============================================================================
# Register    : POWMAN_SCRATCH2
# Description : Scratch register. Information persists in low power mode
.equ	POWMAN_SCRATCH2_OFFSET, 0x000000b8
.equ	POWMAN_SCRATCH2_BITS, 0xffffffff
.equ	POWMAN_SCRATCH2_RESET, 0x00000000
.equ	POWMAN_SCRATCH2_MSB, 31
.equ	POWMAN_SCRATCH2_LSB, 0
# =============================================================================
# Register    : POWMAN_SCRATCH3
# Description : Scratch register. Information persists in low power mode
.equ	POWMAN_SCRATCH3_OFFSET, 0x000000bc
.equ	POWMAN_SCRATCH3_BITS, 0xffffffff
.equ	POWMAN_SCRATCH3_RESET, 0x00000000
.equ	POWMAN_SCRATCH3_MSB, 31
.equ	POWMAN_SCRATCH3_LSB, 0
# =============================================================================
# Register    : POWMAN_SCRATCH4
# Description : Scratch register. Information persists in low power mode
.equ	POWMAN_SCRATCH4_OFFSET, 0x000000c0
.equ	POWMAN_SCRATCH4_BITS, 0xffffffff
.equ	POWMAN_SCRATCH4_RESET, 0x00000000
.equ	POWMAN_SCRATCH4_MSB, 31
.equ	POWMAN_SCRATCH4_LSB, 0
# =============================================================================
# Register    : POWMAN_SCRATCH5
# Description : Scratch register. Information persists in low power mode
.equ	POWMAN_SCRATCH5_OFFSET, 0x000000c4
.equ	POWMAN_SCRATCH5_BITS, 0xffffffff
.equ	POWMAN_SCRATCH5_RESET, 0x00000000
.equ	POWMAN_SCRATCH5_MSB, 31
.equ	POWMAN_SCRATCH5_LSB, 0
# =============================================================================
# Register    : POWMAN_SCRATCH6
# Description : Scratch register. Information persists in low power mode
.equ	POWMAN_SCRATCH6_OFFSET, 0x000000c8
.equ	POWMAN_SCRATCH6_BITS, 0xffffffff
.equ	POWMAN_SCRATCH6_RESET, 0x00000000
.equ	POWMAN_SCRATCH6_MSB, 31
.equ	POWMAN_SCRATCH6_LSB, 0
# =============================================================================
# Register    : POWMAN_SCRATCH7
# Description : Scratch register. Information persists in low power mode
.equ	POWMAN_SCRATCH7_OFFSET, 0x000000cc
.equ	POWMAN_SCRATCH7_BITS, 0xffffffff
.equ	POWMAN_SCRATCH7_RESET, 0x00000000
.equ	POWMAN_SCRATCH7_MSB, 31
.equ	POWMAN_SCRATCH7_LSB, 0
# =============================================================================
# Register    : POWMAN_BOOT0
# Description : Scratch register. Information persists in low power mode
.equ	POWMAN_BOOT0_OFFSET, 0x000000d0
.equ	POWMAN_BOOT0_BITS, 0xffffffff
.equ	POWMAN_BOOT0_RESET, 0x00000000
.equ	POWMAN_BOOT0_MSB, 31
.equ	POWMAN_BOOT0_LSB, 0
# =============================================================================
# Register    : POWMAN_BOOT1
# Description : Scratch register. Information persists in low power mode
.equ	POWMAN_BOOT1_OFFSET, 0x000000d4
.equ	POWMAN_BOOT1_BITS, 0xffffffff
.equ	POWMAN_BOOT1_RESET, 0x00000000
.equ	POWMAN_BOOT1_MSB, 31
.equ	POWMAN_BOOT1_LSB, 0
# =============================================================================
# Register    : POWMAN_BOOT2
# Description : Scratch register. Information persists in low power mode
.equ	POWMAN_BOOT2_OFFSET, 0x000000d8
.equ	POWMAN_BOOT2_BITS, 0xffffffff
.equ	POWMAN_BOOT2_RESET, 0x00000000
.equ	POWMAN_BOOT2_MSB, 31
.equ	POWMAN_BOOT2_LSB, 0
# =============================================================================
# Register    : POWMAN_BOOT3
# Description : Scratch register. Information persists in low power mode
.equ	POWMAN_BOOT3_OFFSET, 0x000000dc
.equ	POWMAN_BOOT3_BITS, 0xffffffff
.equ	POWMAN_BOOT3_RESET, 0x00000000
.equ	POWMAN_BOOT3_MSB, 31
.equ	POWMAN_BOOT3_LSB, 0
# =============================================================================
# Register    : POWMAN_INTR
# Description : Raw Interrupts
.equ	POWMAN_INTR_OFFSET, 0x000000e0
.equ	POWMAN_INTR_BITS, 0x0000000f
.equ	POWMAN_INTR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTR_PWRUP_WHILE_WAITING
# Description : Source is state.pwrup_while_waiting
.equ	POWMAN_INTR_PWRUP_WHILE_WAITING_RESET, 0x0
.equ	POWMAN_INTR_PWRUP_WHILE_WAITING_BITS, 0x00000008
.equ	POWMAN_INTR_PWRUP_WHILE_WAITING_MSB, 3
.equ	POWMAN_INTR_PWRUP_WHILE_WAITING_LSB, 3
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTR_STATE_REQ_IGNORED
# Description : Source is state.req_ignored
.equ	POWMAN_INTR_STATE_REQ_IGNORED_RESET, 0x0
.equ	POWMAN_INTR_STATE_REQ_IGNORED_BITS, 0x00000004
.equ	POWMAN_INTR_STATE_REQ_IGNORED_MSB, 2
.equ	POWMAN_INTR_STATE_REQ_IGNORED_LSB, 2
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTR_TIMER
.equ	POWMAN_INTR_TIMER_RESET, 0x0
.equ	POWMAN_INTR_TIMER_BITS, 0x00000002
.equ	POWMAN_INTR_TIMER_MSB, 1
.equ	POWMAN_INTR_TIMER_LSB, 1
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTR_VREG_OUTPUT_LOW
.equ	POWMAN_INTR_VREG_OUTPUT_LOW_RESET, 0x0
.equ	POWMAN_INTR_VREG_OUTPUT_LOW_BITS, 0x00000001
.equ	POWMAN_INTR_VREG_OUTPUT_LOW_MSB, 0
.equ	POWMAN_INTR_VREG_OUTPUT_LOW_LSB, 0
# =============================================================================
# Register    : POWMAN_INTE
# Description : Interrupt Enable
.equ	POWMAN_INTE_OFFSET, 0x000000e4
.equ	POWMAN_INTE_BITS, 0x0000000f
.equ	POWMAN_INTE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTE_PWRUP_WHILE_WAITING
# Description : Source is state.pwrup_while_waiting
.equ	POWMAN_INTE_PWRUP_WHILE_WAITING_RESET, 0x0
.equ	POWMAN_INTE_PWRUP_WHILE_WAITING_BITS, 0x00000008
.equ	POWMAN_INTE_PWRUP_WHILE_WAITING_MSB, 3
.equ	POWMAN_INTE_PWRUP_WHILE_WAITING_LSB, 3
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTE_STATE_REQ_IGNORED
# Description : Source is state.req_ignored
.equ	POWMAN_INTE_STATE_REQ_IGNORED_RESET, 0x0
.equ	POWMAN_INTE_STATE_REQ_IGNORED_BITS, 0x00000004
.equ	POWMAN_INTE_STATE_REQ_IGNORED_MSB, 2
.equ	POWMAN_INTE_STATE_REQ_IGNORED_LSB, 2
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTE_TIMER
.equ	POWMAN_INTE_TIMER_RESET, 0x0
.equ	POWMAN_INTE_TIMER_BITS, 0x00000002
.equ	POWMAN_INTE_TIMER_MSB, 1
.equ	POWMAN_INTE_TIMER_LSB, 1
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTE_VREG_OUTPUT_LOW
.equ	POWMAN_INTE_VREG_OUTPUT_LOW_RESET, 0x0
.equ	POWMAN_INTE_VREG_OUTPUT_LOW_BITS, 0x00000001
.equ	POWMAN_INTE_VREG_OUTPUT_LOW_MSB, 0
.equ	POWMAN_INTE_VREG_OUTPUT_LOW_LSB, 0
# =============================================================================
# Register    : POWMAN_INTF
# Description : Interrupt Force
.equ	POWMAN_INTF_OFFSET, 0x000000e8
.equ	POWMAN_INTF_BITS, 0x0000000f
.equ	POWMAN_INTF_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTF_PWRUP_WHILE_WAITING
# Description : Source is state.pwrup_while_waiting
.equ	POWMAN_INTF_PWRUP_WHILE_WAITING_RESET, 0x0
.equ	POWMAN_INTF_PWRUP_WHILE_WAITING_BITS, 0x00000008
.equ	POWMAN_INTF_PWRUP_WHILE_WAITING_MSB, 3
.equ	POWMAN_INTF_PWRUP_WHILE_WAITING_LSB, 3
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTF_STATE_REQ_IGNORED
# Description : Source is state.req_ignored
.equ	POWMAN_INTF_STATE_REQ_IGNORED_RESET, 0x0
.equ	POWMAN_INTF_STATE_REQ_IGNORED_BITS, 0x00000004
.equ	POWMAN_INTF_STATE_REQ_IGNORED_MSB, 2
.equ	POWMAN_INTF_STATE_REQ_IGNORED_LSB, 2
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTF_TIMER
.equ	POWMAN_INTF_TIMER_RESET, 0x0
.equ	POWMAN_INTF_TIMER_BITS, 0x00000002
.equ	POWMAN_INTF_TIMER_MSB, 1
.equ	POWMAN_INTF_TIMER_LSB, 1
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTF_VREG_OUTPUT_LOW
.equ	POWMAN_INTF_VREG_OUTPUT_LOW_RESET, 0x0
.equ	POWMAN_INTF_VREG_OUTPUT_LOW_BITS, 0x00000001
.equ	POWMAN_INTF_VREG_OUTPUT_LOW_MSB, 0
.equ	POWMAN_INTF_VREG_OUTPUT_LOW_LSB, 0
# =============================================================================
# Register    : POWMAN_INTS
# Description : Interrupt status after masking & forcing
.equ	POWMAN_INTS_OFFSET, 0x000000ec
.equ	POWMAN_INTS_BITS, 0x0000000f
.equ	POWMAN_INTS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTS_PWRUP_WHILE_WAITING
# Description : Source is state.pwrup_while_waiting
.equ	POWMAN_INTS_PWRUP_WHILE_WAITING_RESET, 0x0
.equ	POWMAN_INTS_PWRUP_WHILE_WAITING_BITS, 0x00000008
.equ	POWMAN_INTS_PWRUP_WHILE_WAITING_MSB, 3
.equ	POWMAN_INTS_PWRUP_WHILE_WAITING_LSB, 3
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTS_STATE_REQ_IGNORED
# Description : Source is state.req_ignored
.equ	POWMAN_INTS_STATE_REQ_IGNORED_RESET, 0x0
.equ	POWMAN_INTS_STATE_REQ_IGNORED_BITS, 0x00000004
.equ	POWMAN_INTS_STATE_REQ_IGNORED_MSB, 2
.equ	POWMAN_INTS_STATE_REQ_IGNORED_LSB, 2
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTS_TIMER
.equ	POWMAN_INTS_TIMER_RESET, 0x0
.equ	POWMAN_INTS_TIMER_BITS, 0x00000002
.equ	POWMAN_INTS_TIMER_MSB, 1
.equ	POWMAN_INTS_TIMER_LSB, 1
# -----------------------------------------------------------------------------
# Field       : POWMAN_INTS_VREG_OUTPUT_LOW
.equ	POWMAN_INTS_VREG_OUTPUT_LOW_RESET, 0x0
.equ	POWMAN_INTS_VREG_OUTPUT_LOW_BITS, 0x00000001
.equ	POWMAN_INTS_VREG_OUTPUT_LOW_MSB, 0
.equ	POWMAN_INTS_VREG_OUTPUT_LOW_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_POWMAN_H
